[
  {
    "section": "376",
    "title": "DA, section 376DB] or section 376E] is alleged or found to have been committed (hereafter",
    "raw_text": "in this section referred to as the victim) shall be punished with imprisonment of either description for a\nterm which may extend to two years and shall also be liable to fine.\n\n(2) Nothing in sub-section (/) extends to any printing or publication of the name or any matter which\nmay make known the identity of the victim if such printing or publication is—\n\n(a) by or under the order in writing of the officer-in-charge of the police station or the police\nofficer making the investigation into such offence acting in good faith for the purposes of such\ninvestigation; or\n\n(b) by, or with the authorisation in writing of, the victim; or\n\n(c) where the victim is dead or minor or of unsound mind, by, or with the authorisation in writing\nof, the next of kin of the victim:\n\nProvided that no such authorisation shall be given by the next of kin to anybody other than the\nchairman or the secretary, by whatever name called, of any recognised welfare institution or organisation.\n\nExplanation.—For the purposes of this sub-section, “recognised welfare institution or organisation”\nmeans a social welfare institution or organisationrecognised in this behalf by the Central or State\nGovernment.\n\n1. Ins. by Act 43 of 1983, s. 2.\n\n2. Subs. by Act 13 of 2013, s. 4, for “offence under section 376, section 376A, section 376B, section 376C or section 376D”\n(w.e.f, 3-2-2013).\n\n3. Subs. by Act 22 of 2018, s. 3, for “section 376A, section 376B, section 376C, section 376D” (w.e.f. 21-4-2018).\n\n58\n\n\n(3) Whoever prints or publishes any matter in relation to any proceeding before a court with respect to\nan offence referred to in sub-section (/) without the previous permission of such court shall be punished\nwith imprisonment of either description for a term which may extend to two years and shall also be liable\nto fine.\n\nExplanation.—The printing or publication of the judgment of any High Court or the Supreme Court\ndoes not amount to an offence within the meaning of this section. ]\n\n229. Personation of a juror or assessor —Whoever, by personation or otherwise, shall intentionally\ncause, or knowingly suffer himself to be returned, empanelled or sworn as a juryman or assessor in any\ncase in which he knows that he is not entitled by law to be so returned, empanelled or sworn, or knowing\nhimself to have been so returned, empanelled or sworn contrary to law, shall voluntarily serve on such\njury or as such assessor, shall be punished with imprisonment of either description for a term which may\nextend to two years, or with fine, or with both.\n\n'[229A. Failure by person released on bail or bond to appear in court.—Whoever, having been\ncharged with an offence and released on bail or on bond without sureties, fails without sufficient cause\n(the burden of proving which shall lie upon him), to appear in court in accordance with the terms of the\nbail or bond, shall be punished with imprisonment of either description for a term which may extend to\none year, or with fine, or with both.\n\nExplanation.—The punishment under this section is—\n\n(a) in addition to the punishment to which the offender would be liable on a conviction for the\noffence with which he has been charged; and\n\n(6) without prejudice to the power of the court to order forfeiture of the bond. |\n\nCHAPTER XII\nOF OFFENCES RELATINGTO COINAND GOVERNMENT STAMPS\n\n230. “Coin” defined.—[Coin is metal used for the time being as money, and stamped and issued by\nthe authority of some State or Sovereign Power in order to be so used.]\n\n3{Indian coin.—Indian coin is metal stamped and issued by the authority of the Government of India\nin order to be used as money; and metal which has been so stamped and issued shall continue to be Indian\ncoin for the purposes of this Chapter, notwithstanding that it may have ceased to be used as money. |\n\nIllustrations\n\n(a) Cowries are not coin.\n\n(b) Lumps of unstamped copper, though used as money, are not coin.\n\n(c) Medals are not coin, inasmuch as they are not intended to be used as money.\n\n(d) The coin denominated as the Company's rupee is “TIndian coin].\n\n*[(e) The “Farukhabad rupee”, which was formerly used as money under the authority of the Government of India, is\nSlIndian coin] although it is no longer so used.]\n\n231. Counterfeiting coin —Whoever counterfeits or knowingly performs any part of the process of\ncounterfeiting coin, shall be punished with imprisonment of either description for a term which may\nextend to seven years, and shall also be liable to fine.\n\nExplanation.—A person commits this offence who intending to practise deception, or knowing it to\nbe likely that deception will thereby be practised, causes a genuine coin to appear like a different coin.\n\n232. Counterfeiting Indian coin Whoever counterfeits, or knowingly performs any part of the\nprocess of counterfeiting “[Indian coin], shall be punished with ‘[imprisonment for life], or with\n\n1. Ins. by Act 25 of 2005, s. 44 (w.e.f. 23-6-2005).\n\n2. Subs. by Act 19 of 1872, s. 1, for the first paragraph.\n\n3. Subs. by the A. O. 1950, for the second paragraph.\n\n4. Subs., ibid., for “the Queen’s coin”.\n\n5. Added by Act 6 of 1896, s. 1(2).\n\n6. Subs. by the A. O. 1950, for “Queen’s coin”\n\n7. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n59\n\n\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\n233. Making or selling instrument for counterfeiting coin—-Whoever makes or mends, or\nperforms any part of the process of making or mending, or buys, sells or disposes of, any die or\ninstrument, for the purpose of being used, or knowing or having reason to believe that it is intended to be\nused, for the purpose of counterfeiting coin, shall be punished with imprisonment of either description for\na term which may extended to three years, and shall also be liable to fine.\n\n234. Making or selling instrument for counterfeiting Indian coin —Whoever makes or mends, or\nperforms any part of the process of making or mending or buys, sells or disposes of, any die or\ninstrument, for the purpose of being used, or knowing or having reason to believe that it is intended to be\nused, for the purpose of counterfeiting '[Indian coin], shall be punished with imprisonment of either\ndescription for a term which may extend to seven years, and shall also be liable to fine.\n\n235. Possession of instrument or material for the purpose of using the same for counterfeiting\ncoin.—Whoever is in possession of any instrument or material, for the purpose of using the same for\ncounterfeiting coin, or knowing or having reason to believe that the same is intended to be used for that\npurpose, shall be punished with imprisonment of either description for a term which may extend to three\nyears, and shall also be liable to fine;\n\nif Indian coin—and if the coin to be counterfeited is '[Indian coin], shall be punished with\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\n236. Abetting in India the counterfeiting out of India of coin —Whoever, being within *[India]\nabets the counterfeiting of coin out of *[India] shall be punished in the same manner as if he abetted the\ncounterfeiting of such coin within “[India].\n\n237. Import or export of counterfeit coin—Whoever imports into [India], or exports therefrom,\nany counterfeit coin, knowing or having reason to believe that the same is counterfeit, shall be punished\nwith imprisonment of either description for a term which may extend to three years, and shall also be\nliable to fine.\n\n238. Import or export of counterfeits of the Indian coin——Whoever imports into *[India], or\nexports therefrom, any counterfeit coin, which he knows or has reason to believe to be a counterfeit of\n'[Indian coin], shall be punished with *[Imprisonment for life], or with imprisonment of either description\ndescription for a term which may extend to ten years, and shall also be liable to fine.\n\n239. Delivery of coin, possessed with knowledge that it is counterfeit—Whoever, having any\ncounterfeit coin, which at the time when he became possessed of it, he knew to be counterfeit,\nfraudulently or with intent that fraud may be committed, delivers the same to any persons or attempts to\ninduce any person to receive it, shall be punished with imprisonment of either description for a term\nwhich may extend to five years, and shall also be liable to fine.\n\n240. Delivery of Indian coin, possessed with knowledge that it is counterfeit Whoever, having\nany counterfeit coin which is a counterfeit of '[Indian coin], and which, at the time when he became\npossessed of it, he knew to be a counterfeit of '[Indian coin], fraudulently or with intent that fraud may be\ncommitted, delivers the same to any person, or attempts to induce any person to receive it, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\n241. Delivery of coin as genuine, which, when first possessed, the deliverer did not know to be\ncounterfeit Whoever delivers to any other person as genuine, or attempts to induce any other person to\nreceive as genuine, any counterfeit coin which he knows to be counterfeit, but which he did not know to\nbe counterfeit at the time when he took it into his possession, shall be punished with imprisonment of\neither description for a term which may extend to two years, or with fine to an amount which may extend\nto ten times the value of the coin counterfeited, or with both.\n\n1. Subs. by the A. O. 1950, for “the Queen’s coin”.\n\n2. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n3. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n60\n\n\nIllustration\n\nA, a coiner, delivers counterfeit Company's rupees to his accomplice B, for the purpose of uttering\nthem. B sells the rupees to C, another utterer, who buys them knowing them to be counterfeit. C pays\naway the rupees for goods to D, who receives them, not knowing them to be counterfeit. D, after\nreceiving the rupees, discovers that they are counterfeit and pays them away as if they were good. Here D\nis punishable only under this section, but B and C are punishable under section 239 or 240, as the case\nmay be.\n\n242. Possession of counterfeit coin by person who knew it to be counterfeit when he became\npossessed thereof —Whoever, fraudulently or with intent that fraud may be committed, is in possession\nof counterfeit coin, having known at the time when he became possessed thereof that such coin was\ncounterfeit, shall be punished with imprisonment of either description for a term which may extend to\nthree years, and shall also be liable to fine.\n\n243. Possession of Indian coin by person who knew it to be counterfeit when he became\npossessed thereof —Whoever, fraudulently or with intent that fraud may be committed, is in possession\nof counterfeit coin, which is a counterfeit of '[Indian coin], having known at the time when he became\npossessed of it that it was counterfeit, shall be punished with imprisonment of either description for a\nterm which may extend to seven years, and shall also be liable to fine.\n\n244. Person employed in mint causing coin to be of different weight or composition from that\nfixed by law.—Whoever, being employed in any mint lawfully established in [India], does any act, or\nomits what he is legally bound to do, with the intention of causing any coin issued from that mint to be of\na different weight or composition from the weight or composition fixed by law, shall be punished with\nimprisonment of either description for a term which may extend to seven years, and shall also be liable to\nfine.\n\n245. Unlawfully taking coining instrument from mint— Whoever, without lawful authority, takes\nout of any mint, lawfully established in “[India], any coining tool or instrument, shall be punished with\nimprisonment of either description for a term which may extend to seven years, and shall also be liable to\nfine.\n\n246. Fraudulently or dishonestly diminishing weight or altering composition of coin —Whoever,\nfraudulently or dishonestly performs on any coin any operation which diminishes the weight or alters the\ncomposition of that coin, shall be punished with imprisonment of either description for a term which may\nextend to three years, and shall also be liable to fine.\n\nExplanation.—A person who scoops out part of the coin and puts anything else into the cavity alters\nthe composition of the coin.\n\n247. Fraudulently or dishonestly diminishing weight or altering composition of Indian coin.—\nWhoever fraudulently or dishonestly performs on *[any Indian coin] any operation which diminishes the\nweight or alters the composition of that coin, shall be punished with imprisonment of either description\nfor a term which may extend to seven years, and shall also be liable to fine.\n\n248. Altering appearance of coin with intent that it shall pass as coin of different description. —\nWhoever performs on any coin any operation which alters the appearance of that coin, with the intention\nthat the said coin shall pass as a coin of a different description, shall be punished with imprisonment of\neither description for a term which may extend to three years, and shall also be liable to fine.\n\n1. Subs. by the A. O. 1950, for “the Queen’s coin”.\n\n2. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n3. Subs. by the A. O. 1950, for “any of the Queen’s coin”.\n\n61\n\n\n249. Altering appearance of Indian coin with intent that it shall pass as coin of different\ndescription —Whoever performs on '[any Indian coin] any operation which alters the appearance of that\ncoin, with the intention that the said coin shall pass as a coin of a different description, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n250. Delivery of coin, possessed with knowledge that it is altered —Whoever, having coin in his\npossession with respect to which the offence defined in section 246 or 248 has been committed, and\nhaving known at the time when he became possessed of such coin that such offence had been committed\nwith respect to it, fraudulently or with intent that fraud may be committed, delivers such coin to any other\nperson, or attempts to induce any other person to receive the same, shall be punished with imprisonment\nof either description for a term which may extend to five years, and shall also be liable to fine.\n\n251. Delivery of Indian coin, possessed with knowledge that it is altered —Whoever, having coin\nin his possession with respect to which the offence defined in section 247 or 249 has been committed, and\nhaving known at the time when he became possessed of such coin that such offence had been committed\nwith respect to it, fraudulently or with intent that fraud may be committed, delivers such coin to any other\nperson, or attempts to induce any other person to receive the same, shall be punished with imprisonment\nof either description for a term which may extend to ten years, and shall also be liable to fine.\n\n252. Possession of coin by person who knew it to be altered when he became possessed\nthereof.—Whoever fraudulently or with intent that fraud may be committed, is in possession of coin with\nrespect to which the offence defined in either of the section 246 or 248 has been committed, having\nknown at the time of becoming possessed thereof that such offence had been committed with respect to\nsuch coin, shall be punished with imprisonment of either description for a term which may extend to three\nyears, and shall also be liable to fine.\n\n253. Possession of Indian coin by person who knew it to be altered when he became possessed\nthereof.—Whoever, fraudulently or with intent that fraud may be committed, is in possession of coin\nwith respect to which the offence defined in either of the section 247 or 249 has been committed having\nknown at the time of becoming possessed thereof, that such offence had been committed with respect to\nsuch coin, shall be punished with imprisonment of either description for a term which may extend to five\nyears, and shall also be liable to fine.\n\n254. Delivery of coin as genuine which, when first possessed, the deliverer did not know to be\naltered —Whoever delivers to any other person as genuine or as a coin of a different description from\nwhat it is, or attempts to induce any person to receive as genuine, or as a different coin from what it is,\nany coin in respect of which he knows that any such operation as that mentioned in sections 246, 247, 248\nor 249 has been performed, but in respect of which he did not, at the time when he took it into his\npossession, know that such operation had been performed, shall be punished with imprisonment of either\ndescription for a term which may extend to two years, or with fine to an amount which may extend to ten\ntimes the value of the coin for which the altered coin is passed, or attempted to be passed.\n\n255. Counterfeiting Government stamp. Whoever counterfeits, or knowingly performs any part\nof the process of counterfeiting, any stamp issued by Government for the purpose of revenue shall be\npunished with [imprisonment for life] or with imprisonment of either description for a term which may\nextend to ten years, and shall also be liable to fine.\n\nExplanation.—A person commits this offence who counterfeits by causing a genuine stamps of one\ndenomination to appear like a genuine stamp of a different denomination.\n\n256. Having possession of instrument or material for counterfeiting Government stamp.\nWhoever has in his possession any instrument or material for the purpose of being used, or knowing or\nhaving reason to believe that it is intended to be used, for the purpose of counterfeiting any stamp issued\nby Government for the purpose of revenue, shall be punished with imprisonment of either description for\na term which may extend to seven years, and shall also be liable to fine.\n\n1. Subs. by the A. O. 1950, for “any of the Queen’s coin”.\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n62\n\n\n257. Making or selling instrument for counterfeiting Government stamp— Whoever makes or\nperforms any part of the process of making, or buys, or sells, or disposes or, any instrument for the\npurpose of being used, or knowing or having reason to believe that it is intended to be used, for the\npurpose of counterfeiting any stamp issued by Government for the purpose of revenue, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n258. Sale of counterfeit Government stamp.—Whoever sells, or offers for sale, any stamp which he\nknows or has reason to believe to be a counterfeit of any stamp issued by Government for the purpose of\nrevenue, shall be punished with imprisonment of either description for a term which may extend to seven\nyears, and shall also be liable to fine.\n\n259. Having possession of counterfeit Government stamp.—Whoever has in his possession any\nstamp which he knows to be a counterfeit of any stamp issued by Government for the purpose of revenue,\nintending to use, or dispose of the same as a genuine stamp, or in order that it may be used as a genuine\nstamp, shall be punished with imprisonment of either description for a term which may extend to seven\nyears, and shall also be liable to fine.\n\n260. Using as genuine a Government stamp known to be counterfeit—Whoever uses as genuine\nany stamp, knowing it to be a counterfeit of any stamp issued by Government for the purpose of revenue,\nshall be punished with imprisonment of either description for a term which may extend to seven years, or\nwith fine, or with both.\n\n261. Effacing writing from substance bearing Government stamp, or removing from document\na stamp used for it, with intent to cause loss to Government.—Whoever, fraudulently or with intent to\ncause loss to the Government, removes or effaces from any substance, bearing any stamp issued by\nGovernment for the purpose of revenue, any writing or document for which such stamp has been used, or\nremoves from any writing or document a stamp which has been used for such writing or document, in\norder that such stamp may be used for a different writing or document, shall be punished with\nimprisonment of either description for a term which may extend to three years, or with fine, or with both.\n\n262. Using Government stamp known to have been before used.—Whoever, fraudulently or with\nintent to cause loss to the Government, uses for any purpose a stamp issued by Government for the\npurpose of revenue, which he knows to have been before used, shall be punished with imprisonment of\neither description for a term which may extend to two years, or with fine, or with both.\n\n263. Erasure of mark denoting that stamp has been used.—Whoever, fraudulently or with intent\nto cause loss to Government, erases or removes from a stamp issued by Government for the purpose of\nrevenue, any mark, put or impressed upon such stamp for the purpose of denoting that the same has been\nused, or knowingly has in his possession or sells or disposes of any such stamp from which such mark has\nbeen erased or removed, or sells or disposes of any such stamp which he knows to have been used, shall\nbe punished with imprisonment of either description for a term which may extend to three years, or with\nfine, or with both.\n\n'[263A. Prohibition of fictitious stamps —(/) Whoever—\n\n(a) makes, knowingly utters, deals in or sells any fictitious stamp, or knowingly uses for any\npostal purpose any fictitious stamp, or\n\n(b) has in his possession, without lawful excuse, any fictitious stamp, or\n\n(c) makes or, without lawful excuse, has in his possession any die, plate, instrument or materials\nfor making any fictitious stamp,\n\nshall be punished with fine which may extend to two hundred rupees.\n\n(2) Any such stamp, die, plate, instrument or materials in the possession of any person for making any\nfictitious stamp *[may be seized and, if seized] shall be forfeited.\n\n(3) In this section “fictitious stamp” means any stamp falsely purporting to be issued by Government\nfor the purpose of denoting a rate of postage, or any facsimile or imitation or representation, whether on\npaper or otherwise, of any stamp issued by Government for that purpose.\n\n1. Added by Act 3 of 1895, s. 2.\n2. Subs. by Act 42 of 1953, s. 4 and the Third Sch., for “may be seized and”.\n\n63\n\n\n(4) In this section and also in sections 255 to 263, both inclusive, the word “Government”, when used\nin connection with, or in reference to any stamp issued for the purpose of denoting a rate of postage, shall,\nnotwithstanding anything in section 17, be deemed to include the person or persons authorized by law to\nadminister executive government in any part of India, and also in any part of Her Majesty's dominions or\nin any foreign country.\n\nCHAPTER XIII\nOF OFFENCESRELATINGTO WEIGHTSAND MEASURES\n\n264. Fraudulent use of false instrument for weighing —Whoever, fraudulently uses any instrument\nfor weighing which he knows to be false, shall be punished with imprisonment of either description for a\nterm which may extend to one year, or with fine, or with both.\n\n265. Fraudulent use of false weight or measure.—Whoever, fraudulently uses any false weight or\nfalse measure of length or capacity, or fraudulently uses any weight or any measure of length or capacity\nas a different weight or measure from what it is, shall be punished with imprisonment of either description\nfor a term which may extend to one year, or with fine, or with both.\n\n266. Being in possession of false weight or measure —Whoever is in possession of any instrument\nfor weighing, or of any weight, or of any measure of length or capacity, which he knows to be false,\n'** intending that the same may be fraudulently used, shall be punished with imprisonment of either\ndescription for a term which may extend to one year, or with fine, or with both.\n\n267. Making or selling false weight or measure—Whoever makes, sells or disposes of any\ninstrument for weighing, or any weight, or any measure of length or capacity which he knows to be false,\nin order that the same may be used as true, or knowing that the same is likely to be used as true, shall be\npunished with imprisonment of either description for a term which may extend to one year, or with fine,\nor with both.\n\nCHAPTER XIV\nOF OFFENCESAFFECTINGTHE PUBLIC HEALTH, SAFETY, CONVENIENCE, DECENCYAND MORALS\n\n268. Public nuisance.—A person is guilty of a public nuisance who does any act or is guilty of an\nillegal omission which causes any common injury, danger or annoyance to the public or to the people in\ngeneral who dwell or occupy property in the vicinity, or which must necessarily cause injury, obstruction,\ndanger or annoyance to persons who may have occasion to use any public right.\n\nA common nuisance is not excused on the ground that it causes some convenience or advantage.\n\n269. Negligent act likely to spread infection of disease dangerous to life —Whoever unlawfully or\nnegligently does any act which is, and which he knows or has reason to believe to be, likely to spread the\ninfection of any disease dangerous to life, shall be punished with imprisonment of either description for a\nterm which may extend to six months, or with fine, or with both.\n\n270. Malignant act likely to spread infection of disease dangerous to life—Whoever malignantly\ndoes any act which is, and which he knows or has reason the believe to be, likely to spread the infection\nof any disease dangerous to life, shall be punished with imprisonment of either description for a term\nwhich may extend to two years, or with fine, or with both.\n\n271. Disobedience to quarantine rule—Whoever knowingly disobeys any rule made and\npromulgated *[by the **** Government ****] for putting any vessel into a state of quarantine, or for\nregulating the intercourse of vessels in a state of quarantine with the shore or with other vessels, for\nregulating the intercourse between places where an infectious disease prevails and other places, shall be\npunished with imprisonment of either description for a term which may extend to six months, or with\nfine, or with both.\n\n272. Adulteration of food or drink intended for sale—Whoever adulterates any article of food or\ndrink, so as to make such article noxious as food or drink, intending to sell such article as food or drink,\n\n1. The word “and” omitted by Act 42 of 1953, s. 4 and the Third Sch.\n\n2. Subs. by the A. O. 1937, for “by the G. of I., or by any Government”.\n3. The words “Central or any Provincial” omitted by the A. O. 1950.\n\n4. The words “or the Crown Representative” omitted by the A. O. 1948.\n\n64\n\n\nor knowing it to be likely that the same will be sold as food or drink, shall be punished with imprisonment\nof either description for a term which may extend to six months, or with fine which may extend to one\nthousand rupees, or with both.\n\n273. Sale of noxious food or drink.—Whoever sells, or offers or exposes for sale, as food or drink,\nany article which has been rendered or has become noxious, or is in a state unfit for food or drink,\nknowing or having reason to believe that the same is noxious as food or drink, shall be punished with\nimprisonment of either description for a term which may extend to six months, or with fine which may\nextend to one thousand rupees, or with both.\n\n274. Adulteration of drugs —Whoever adulterates any drug or medical preparation in such a manner\nas to lessen the efficacy or change the operation of such drug or medical preparation, or to make it\nnoxious, intending that it shall be sold or used for, or knowing it to be likely that it will be sold or used\nfor, any medicinal purpose, as if it had not undergone such adulteration, shall be punished with\nimprisonment of either description for a term which may extend to six months, or with fine which may\nextend to one thousand rupees, or with both.\n\n275. Sale of adulterated drugs — Whoever, knowing any drug or medical preparation to have been\nadulterated in such a manner as to lessen its efficacy, to change its operation, or to render it noxious, sells\nthe same, or offers or exposes it for sale, or issues it from any dispensary for medicinal purposes as\nunadulterated, or causes it to be used for medicinal purposes by any person not knowing of the\nadulteration, shall be punished with imprisonment of either description for a term which may extend to\nsix months, or with fine which may extend to one thousand rupees, or with both.\n\n276. Sale of drug as a different drug or preparation—Whoever knowingly sells, or offers or\nexposes for sale, or issues from a dispensary for medicinal purposes, any drug or medical preparation, as a\ndifferent drug or medical preparation, shall be punished with imprisonment of either description for a\nterm which may extend to six months, or with fine which may extend to one thousand rupees, or with\nboth.\n\n277. Fouling water of public spring or reservoir —Whoever voluntarily corrupts or fouls the water\nof any public spring or reservoir, so as to render it less fit for the purpose for which it is ordinarily used,\nshall be punished with imprisonment of either description for a term which may extend to three months,\nor with fine which may extend to five hundred rupees, or with both.\n\n278. Making atmosphere noxious to health—Whoever voluntarily vitiates the atmosphere in any\nplace so as to make it noxious to the health of persons in general dwelling or carrying on business in the\nneighbourhood or passing along a public way, shall be punished with fine which may extend to five\nhundred rupees.\n\n279. Rash driving or riding on a public way.— Whoever drives any vehicle, or rides, on any public\nway in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to\nany other person, shall be punished with imprisonment of either description for a term which may extend\nto six months, or with fine which may extend to one thousand rupees, or with both.\n\n280. Rash navigation of vessel —Whoever navigates any vessel in a manner so rash or negligent as\nto endanger human life, or to be likely to cause hurt or injury to any other person, shall be punished with\nimprisonment of either description for a term which may extend to six months, or with fine which may\nextend to one thousand rupees, or with both.\n\n281. Exhibition of false light, mark or buoy.—Whoever exhibits any false light, mark or buoy,\nintending or knowing it to be likely that such exhibition will mislead any navigator, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, or with fine, or with\nboth.\n\n282. Conveying person by water for hire in unsafe or overloaded vessel— Whoever knowingly or\nnegligently conveys, or causes to be conveyed for hire, any person by water in any vessel, when that\nvessel is in such a state or so loaded as to endanger the life of that person, shall be punished with\nimprisonment of either description for a term which may extend to six months, or with fine which may\nextend to one thousand rupees, or with both.\n\n65\n\n\n283. Danger or obstruction in public way or line of navigation —Whoever, by doing any act, or\nby omitting to take order with any property in his possession or under his charge, causes danger,\nobstruction or injury to any person in any public way or public line of navigation, shall be punished, with\nfine which may extend to two hundred rupees.\n\n284. Negligent conduct with respect to poisonous substance —Whoever does, with any poisonous\nsubstance, any act in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt\nor injury to any person,\n\nor knowingly or negligently omits to take such order with any poisonous substance in his possession\nas is sufficient to guard against any probable danger to human life from such poisonous substance,\n\nshall be punished with imprisonment of either description for a term which may extend to six months,\nor with fine which may extend to one thousand rupees, or with both.\n\n285. Negligent conduct with respect to fire or combustible matter—Whoever does, with fire or\nany combustible matter, any act so rashly or negligently as to endanger human life, or to be likely to\ncause hurt or injury to any other person, or knowingly or negligently omits to take such order with any\nfire or any combustible matter in his possession as is sufficient to guard against any probable danger to\nhuman life from such fire or combustible matter,\n\nshall be punished with imprisonment of either description for a term which may extend to six months,\nor with fine which may extend to one thousand rupees, or with both.\n\n286. Negligent conduct with respect to explosive substance —Whoever does, with any explosive\nsubstance, any act so rashly or negligently as to endanger human life, or to be likely to cause hurt or\ninjury to any other person,\n\nor knowingly or negligently omits to take such order with any explosive substance in his possession\nas is sufficient to guard against any probable danger to human life from that substance,\n\nshall be punished with imprisonment of either description for a term which may extend to six months,\nor with fine which may extend to one thousand rupees, or with both.\n\n287. Negligent conduct with respect to machinery —Whoever does, with any machinery, any act\nso rashly or negligently as to endanger human life or to be likely to cause hurt or injury to any other\nperson,\n\nor knowingly or negligently omits to take such order with any machinery in his possession or under\nhis care as is sufficient to guard against any probable danger to human life from such machinery,\n\nshall be punished with imprisonment of either description for a term which may extend to six months,\nor with fine which may extend to one thousand rupees, or with both.\n\n288. Negligent conduct with respect to pulling down or repairing buildings—Whoever, in\npulling down or repairing any building, knowingly or negligently omits to take such order with that\nbuilding as is sufficient to guard against any probable danger to human life from the fall of that building,\nor of any part thereof, shall be punished with imprisonment of either description for a term which may\nextend to six months, or with fine which may extend to one thousand rupees, or with both.\n\n289. Negligent conduct with respect to animal—Whoever knowingly or negligently omits to take\nsuch order with any animal in his possession as is sufficient to guard against any probable danger to\nhuman life, or any probable danger of grievous hurt from such animal, shall be punished with\nimprisonment of either description for a term which may extend to six months, or with fine which may\nextend to one thousand rupees, or with both.\n\n290. Punishment for public nuisance in cases not otherwise provided for—Whoever commits a\npublic nuisance in any case not otherwise punishable by this Code, shall be punished with fine which may\nextend to two hundred rupees.\n\n291. Continuance of nuisance after injunction to discontinue—Whoever repeats or continues a\npublic nuisance, having been enjoined by any public servant who has lawful authority to issue such\ninjunction not to repeat or continue such nuisance, shall be punished with simple imprisonment for a term\nwhich may extend to six months, or with fine, or with both.\n\n66\n\n\n'[292. Sale, ete., of obscene books, ete —[(/) For the purposes of sub-section (2), a book, pamphlet,\npaper, writing, drawing, painting, representation, figure or any other object, shall be deemed to be\nobscene if it is lascivious or appeals to the prurient interest or if its effect, or (where it comprises two or\nmore distinct items) the effect of any one of its items, is, if taken as a whole, such as to tend to deprave\nand corrupt persons who are likely, having regard to all relevant circumstances, to read, see or hear the\nmatter contained or embodied in it.]\n\n3[(2)] Whoever—\n\n(a) sells, lets to hire, distributes, publicity exhibits or in any manner puts into circulation, or for\npurposes of sale, hire, distribution, public exhibition or circulation, makes, produces or has in his\npossession any obscene book, pamphlet, paper, drawing, painting, representation or figure or any\nother obscene object whatsoever, or\n\n(6) imports, exports or conveys any obscene object for any of the purposes aforesaid, or knowing\nor having reason to believe that such object will be sold, let to hire, distributed or publicly exhibited\nor in any manner put into circulation, or\n\n(c) takes part in or receives profits from any business in the course of which he knows or has\nreason to believe that any such obscene objects are, for any of the purposes aforesaid, made,\nproduced, purchased, kept, imported, exported, conveyed, publicly exhibited or in any manner put\ninto circulation, or\n\n(d) advertises or makes known by any means whatsoever that any person is engaged or is ready to\nengage in any act which is an offence under this section, or that any such obscene object can be\nprocured from or through any person, or\n\n(e) offers or attempts to do any act which is an offence under this section,\n\nshall be punished “[on first conviction with imprisonment of either description for a term which may\nextend to two years, and with fine which may extend to two thousand rupees, and, in the event of a\nsecond or subsequent conviction, with imprisonment of either description for a term which may extend to\nfive years, and also with fine which may extend to five thousand rupees].\n\n*[Exception.—This section does not extend to—\n(a) any book, pamphlet, paper, writing, drawing, painting, representation or figure—\n\n(i) the publication of which is proved to be justified as being for the public good on the\nground that such book, pamphlet, paper, writing, drawing, painting, representation or figure is in\nthe interest of science, literature, art or learning or other objects of general concern, or\n\n(ii) which is kept or used bona fide for religious purposes;\n(6) any representation sculptured, engraved, painted or otherwise represented on or in—\n\n(Z) any ancient monument within the meaning of the Ancient Monuments and Archaeological\nSites and Remains Act, 1958 (24 of 1958), or\n\n(ii) any temple, or on any car used for the conveyance of idols, or kept or used for any\nreligious purpose. |]\n\n°[293. Sale, etc., of obscene objects to young person —Whoever sells, lets to hire, distributes,\nexhibits or circulates to any person under the age of twenty years any such obscene object as is referred to\nin the last preceding section, or offers or attempts so to do, shall be punished ‘fon first conviction with\nimprisonment of either description for a term which may extend to three years, and with fine which may\nextend to two thousand rupees, and, in the event of a second or subsequent conviction, with imprisonment\nof either description for a term which may extend to seven years, and also with fine which may extend to\nfive thousand rupees]. ]\n\n1. Subs. by Act 8 of 1925, s. 2, for s. 292.\n\n2. Ins. by Act 36 of 1969, s. 2.\n\n3. S. 292 renumbered as sub-section (2) thereof by s. 2, ibid.\n4. Subs. s. 2, ibid., for certain words.\n\n5. Subs. by s. 2, ibid., for Exception.\n\n6. Subs. by Act 8 of 1925, s. 2, for section 293.\n\n67\n\n\n'[294. Obscene acts and songs.—Whoever, to the annoyance of others,\n(a) does any obscene act in any public place, or\n(b) sings, recites or utters any obscene song, ballad or words, in or near any public place,\n\nshall be punished with imprisonment of either description for a term which may extend to three months,\nor with fine, or with both.]\n\n*[294A. Keeping lottery office —Whoever keeps any office or place for the purpose of drawing any\nlottery *[not being “[a State lottery] or a lottery authorised by the °[State] Government], shall be punished\npunished with imprisonment of either description for a term which may extend to six months, or with\nfine, or with both.\n\nAnd whoever publishes any proposal to pay any sum, or to deliver any goods, or to do or forbear\ndoing anything for the benefit of any person, on any event or contingency relative or applicable to the\ndrawing of any ticket, lot, number or figure in any such lottery, shall be punished with fine which may\nextend to one thousand rupees. }\n\nCHAPTER XV\nOF OFFENCESRELATING TO RELIGION\n\n295. Injuring or defiling place of worship, with intent to insult the religion of any class —\nWhoever destroys, damages or defiles any place of worship, or any object held sacred by any class of\npersons with the intention of thereby insulting the religion of any class of persons or with the knowledge\nthat any class of persons is likely to consider such destruction, damage or defilement as an insult to their\nreligion, shall be punished with imprisonment of either description for a term which may extend to two\nyears, or with fine, or with both.\n\n°[295A. Deliberate and malicious acts, intended to outrage religious feelings of any class by\ninsulting its religion or religious beliefs—Whoever, with deliberate and malicious intention of\noutraging the religious feelings of any class of \"[citizens of India], ‘[by words, either spoken or written, or\nor by signs or by visible representations or otherwise], insults or attempts to insult the religion or the\nreligious beliefs of that class, shall be punished with imprisonment of either description for a term which\nmay extend to *[three years], or with fine, or with both.]\n\n296. Disturbing religious assembly—Whoever voluntarily causes disturbance to any assembly\nlawfully engaged in the performance of religious worship, or religious ceremonies, shall be punished with\nimprisonment of either description for a term which may extend to one year, or with fine, or with both.\n\n297. Trespassing on burial places, ete —Whoever, with the intention of wounding the feelings of\nany person, or of insulting the religion of any person or with the knowledge that the feelings of any\nperson are likely to be wounded, or that the religion of any person is likely to be insulted thereby,\n\ncommits any trespass in any place of worship or on any place of sepulture, or any place set apart for\nthe performance of funeral rites or as a depository for the remains of the dead, or offers any indignity to\nany human corpse, or causes disturbance to any persons assembled for the performance of funeral\nceremonies,\n\nshall be punished with imprisonment of either description for a term which may extend to one year, or\nwith fine, or with both.\n\n298. Uttering words, etc., with deliberate intent to wound religious feelings ——Whoever, with the\ndeliberate intention of wounding the religious feelings of any person, utters any word or makes any sound\n\n. Subs. by Act 3 of 1895, s. 3, for section 294.\n\n. Ins. by Act 27 of 1870, s. 10.\n\n. Subs. by the A. O. 1937, for “not authorized by Government”.\n\n. Subs. by Act 3 of 1951, s. 3 and the Sch., for “a lottery organized by the Central Government or the Government of a Part A\nState or a Part B State”.\n\n. Subs. by the A. O. 1950, for “Provincial”.\n\n. Ins. by Act 25 of 1927, s. 2.\n\n. Subs. by the A. O. 1950, for “His Majesty’s subjects”.\n\n. Subs. by Act 41 of 1961, s. 3, for certain words.\n\n. Subs. by s. 3, ibid., for “two years”.\n\nBRWNrFe\n\nOMANI DN\n\n68\n\n\nin the hearing of that person or makes any gesture in the sight of that persons or places any object in the\nsight of that person, shall be punished with imprisonment of either description for a term which may\nextend to one year, or with fine, or with both.\n\nCHAPTER XVI\nOF OFFENCESAFFECTINGTHE HUMAN BODY\n\nOf offences affecting life\n\n299. Culpable homicide —Whoever causes death by doing an act with the intention of causing\ndeath, or with the intention of causing such bodily injury as is likely to cause death, or with the\nknowledge that he is likely by such act to cause death, commits the offence of culpable homicide.\n\nIllustrations\n\n(a) A lays sticks and turf over a pit, with the intention of thereby causing death, or with the knowledge that death is likely to\nbe thereby caused. Z, believing the ground to be firm, treads on it, falls in and is killed. A has committed the offence of culpable\nhomicide.\n\n(b) A knows Z to be behind a bush. B does not know it. A, intending to cause, or knowing it to be likely to cause Z's death,\ninduces B to fire at the bush. B fires and kills Z. Here B may be guilty of no offence; but A has committed the offence of culpable\nhomicide.\n\n(c) A, by shooting at a fowl with intent to kill and steal it, kills B, who is behind a bush; A not knowing that he was there.\nHere, although A was doing an unlawful act, he was not guilty of culpable homicide, as he did not intend to kill B, or to cause\ndeath by doing an act that he knew was likely to cause death.\n\nExplanation 1.—A person who causes bodily injury to another who is labouring under a disorder,\ndisease or bodily infirmity, and thereby accelerates the death of that other, shall be deemed to have caused\nhis death.\n\nExplanation 2.—Where death is caused by bodily injury, the person who causes such bodily injury\nshall be deemed to have caused the death, although by resorting to proper remedies and skilful treatment\nthe death might have been prevented.\n\nExplanation 3.—The causing of the death of a child in the mother's womb is not homicide. But it may\namount to culpable homicide to cause the death of a living child, if any part of that child has been brought\nforth, though the child may not have breathed or been completely born.\n\n300. Murder.—Except in the cases hereinafter excepted, culpable homicide is murder, if the act by\nwhich the death is caused is done with the intention of causing death, or—\n\n2ndly.—If it is done with the intention of causing such bodily injury as the offender knows to be\nlikely to cause the death of the person to whom the harm is caused, or—\n\n3rdly.—TIf it is done with the intention of causing bodily injury to any person and the bodily injury\nintended to be inflicted is sufficient in the ordinary course of nature to cause death, or—\n\n4thly —If the person committing the act knows that it is so imminently dangerous that it must, in all\nprobability, cause death, or such bodily injury as is likely to cause death, and commits such act without\nany excuse for incurring the risk of causing death or such injury as aforesaid.\n\nIllustrations\n(a) A shoots Z with the intention of killing him. Z dies in consequence. A commits murder.\n\n(b) A, knowing that Z is labouring under such a disease that a blow is likely to cause his death, strikes him with the intention\nof causing bodily injury. Z dies in consequence of the blow. A is guilty of murder, although the blow might not have been\nsufficient in the ordinary course of nature to cause the death of a person in a sound state of health. But if A, not knowing that Z is\nlabouring under any disease, gives him such a blow as would not in the ordinary course of nature kill a person in a sound state of\nhealth, here A, although he may intend to cause bodily injury, is not guilty of murder, if he did not intend to cause death, or such\nbodily injury as in the ordinary course of nature would cause death.\n\n(c) A intentionally gives Z a sword-cut or club-wound sufficient to cause the death of a man in the ordinary course of nature.\nZ dies in consequence. Here A is guilty of murder, although he may not have intended to cause Z's death.\n\n(d) A without any excuse fires a loaded cannon into a crowd of persons and kills one of them. A is guilty of murder,\nalthough he may not have had a premeditated design to kill any particular individual.\n\n69\n\n\nException 1—When culpable homicide is not murder.—Culpable homicide is not murder if the\noffender, whilst deprived of the power of self-control by grave and sudden provocation, causes the death\nof the person who gave the provocation or causes the death of any other person by mistake or accident.\n\nThe above exception is subject to the following provisos:—\n\nFirst.—That the provocation is not sought or voluntarily provoked by the offender as an excuse for\nkilling or doing harm to any person.\n\nSecondly.—That the provocation is not given by anything done in obedience to the law, or by a public\nservant in the lawful exercise of the powers of such public servant.\n\nThirdly.—That the provocation is not given by anything done in the lawful exercise of the right of\nprivate defence.\n\nExplanation.—Whether the provocation was grave and sudden enough to prevent the offence from\namounting to murder is a question of fact.\n\nIllustrations\n\n(a) A, under the influence of passion excited by a provocation given by Z, intentionally kills Y, Z's child. This is murder,\ninasmuch as the provocation was not given by the child, and the death of the child was not caused by accident or misfortune in\ndoing an act caused by the provocation.\n\n(b) Y gives grave and sudden provocation to A. A, on this provocation, fires a pistol at Y, neither intending nor knowing\nhimself to be likely to kill Z, who is near him, but out of sight. A kills Z. Here A has not committed murder, but merely culpable\nhomicide.\n\n(c) A is lawfully arrested by Z, a bailiff. A is excited to sudden and violent passion by the arrest, and kills Z. This is murder,\ninasmuch as the provocation was given by a thing done by a public servant in the exercise of his powers.\n\n(d) A appears as a witness before Z, a Magistrate. Z says that he does not believe a word of A's deposition, and that A has\nperjured himself. A is moved to sudden passion by these words, and kills Z. This is murder.\n\n(e)A attempts to pull Z's nose. Z, in the exercise of the right of private defence, lays hold of A to prevent him from doing so.\nA is moved to sudden and violent passion in consequence, and kills Z. This is murder, inasmuch as the provocation was giving by\na thing done in the exercise of the right of private defence.\n\n(f) Z strikes B. B is by this provocation excited to violent rage. A, a bystander, intending to take advantage of B's rage, and\nto cause him to kill Z, puts a knife into B's hand for that purpose. B kills Z with the knife. Here B may have committed only\nculpable homicide, but A is guilty of murder.\n\nException 2.—Culpable homicide is not murder if the offender in the exercise in good faith of the\nright of private defence of person or property, exceeds the power given to him by law and causes the\ndeath of the person against whom he is exercising such right of defence without premeditation, and\nwithout any intention of doing more harm than is necessary for the purpose of such defence.\n\nIllustration\n\nZ attempts to horsewhip A, not in such a manner as to cause grievous hurt to A. A draws out a pistol. Z persists in the\nassault. A believing in good faith that he can by no other means prevent himself from being horsewhipped, shoots Z dead. A has\nnot committed murder, but only culpable homicide.\n\nException 3—Culpable homicide is not murder if the offender, being a public servant or aiding a\npublic servant acting for the advancement of public justice, exceeds the powers given to him by law, and\ncauses death by doing an act which he, in good faith, believes to be lawful and necessary for the due\ndischarge of his duty as such public servant and without ill-will towards the person whose death is\ncaused.\n\nException 4.—Culpable homicide is not murder if it is committed without premeditation in a sudden\nfight in the heat of passion upon a sudden quarrel and without the offender's having taken undue\nadvantage or acted in a cruel or unusual manner.\n\nExplanation.—It is immaterial in such cases which party offers the provocation or commits the first\nassault.\n\nException 5—Culpable homicide is not murder when the person whose death is caused, being above\nthe age of eighteen years, suffers death or takes the risk of death with his own consent.\n\n70\n\n\nIllustration\n\nA, by instigation, voluntarily causes Z, a person under eighteen years of age to commit suicide. Here, on account of Z's\nyouth, he was incapable of giving consent to his own death; A has therefore abetted murder.\n\n301. Culpable homicide by causing death of person other than person whose death was\nintended —If a person, by doing anything which he intends or knows to be likely to cause death,\ncommits culpable homicide by causing the death of any person, whose death he neither intends nor knows\nhimself to be likely to cause, the culpable homicide committed by the offender is of the description of\nwhich it would have been if he had caused the death of the person whose death he intended or knew\nhimself to he likely to cause.\n\n302. Punishment for murder.—Whoever commits murder shall be punished with death or\n[imprisonment for life], and shall also be liable to fine.\n\n303. Punishment for murder by life-convict—Whoever, being under sentence of '[imprisonment\nfor life], commits murder, shall be punished with death.\n\n304. Punishment for culpable homicide not amounting to murder—Whoever commits culpable\nhomicide not amounting to murder, shall be punished with '[imprisonment for life], or imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine, if the act by\nwhich the death is caused is done with the intention of causing death, or of causing such bodily injury as\nis likely to cause death;\n\nor with imprisonment of either description for a term which may extend to ten years, or with fine, or\nwith both, if the act is done with the knowledge that it is likely to cause death, but without any intention\nto cause death, or to cause such bodily injury as is likely to cause death.\n\n*[304A. Causing death by negligence —Whoever causes the death of any person by doing any rash\nor negligent act not amounting to culpable homicide, shall be punished with imprisonment of either\ndescription for a term which may extend to two years, or with fine, or with both.]\n\n*[304B. Dowry death —(/) Where the death of a woman is caused by any burns or bodily injury or\noccurs otherwise than under normal circumstances within seven years of her marriage and it is shown that\nsoon before her death she was subjected to cruelty or harassment by her husband or any relative of her\nhusband for, or in connection with, any demand for dowry, such death shall be called “dowry death”, and\nsuch husband or relative shall be deemed to have caused her death.\n\nExplanation.—For the purposes of this sub-section, “dowry” shall have the same meaning as in",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  },
  {
    "section": "2",
    "title": "of the Dowry Prohibition Act, 1961 (28 of 1961).",
    "raw_text": "(2) Whoever commits dowry death shall be punished with imprisonment for a term which shall not be\nless than seven years but which may extend to imprisonment for life.]\n\n305. Abetment of suicide of child or insane person.—If any person under eighteen years of age,\nany insane person, any delirious person, any idiot, or any person in a state of intoxication, commits\nsuicide, whoever abets the commission of such suicide, shall be punished with death or '[imprisonment\nfor life], or imprisonment for a term not exceeding ten years, and shall also be liable to fine.\n\n306. Abetment of suicide —If any person commits suicide, whoever abets the commission of such\nsuicide, shall be punished with imprisonment of either description for a term which may extend to ten\nyears, and shall also be liable to fine.\n\n307. Attempt to murder.—Whoever does any act with such intention or knowledge, and under such\ncircumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine; and if hurt is caused to any person by such act, the offender shall be liable either to '[imprisonment\nfor life], or to such punishment as is hereinbefore mentioned.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n2. Ins. by Act 27 of 1870, s. 12.\n3. Ins. by Act 43 of 1986, s. 10 (w.e.f. 19-11-1986).\n\n71\n\n\nAttempts by life-convicts—'[When any person offending under this section is under sentence of\n[imprisonment for life], he may, if hurt is caused, be punished with death.]\n\nIllustrations\n\n(a) A shoots at Z with intention to kill him, under such circumstances that, if death ensued A would be guilty of murder. A is\nliable to punishment under this section.\n\n(b) A, with the intention of causing the death of a child of tender years, exposes it in a desert place A has committed the\noffence defined by this section, though the death of the child does not ensue.\n\n(c) A, intending to murder Z, buys a gun and loads it. A has not yet committed the offence. A fires the gun at Z. He has\ncommitted the offence defined in this section, and, if by such firing he wounds Z, he is liable to the punishment provided by the\nlatter part of ’[the first paragraph of] this section.\n\n(d) A, intending to murder Z by poison, purchases poison and mixes the same with food which remains in A's keeping; A\nhas not yet committed the offence defined in this section. A places the food on Z's table or delivers it to Z's servants to place it on\nZ's table. A has committed the offence defined in this section.\n\n308. Attempt to commit culpable homicide—Whoever does any act with such intention or\nknowledge and under such circumstances that, if he by that act caused death, he would be guilty of\nculpable homicide not amounting to murder, shall be punished with imprisonment of either description\nfor a term which may extend to three years, or with fine, or with both; and, if hurt is caused to any person\nby such act, shall be punished with imprisonment of either description for a term which may extend to\nseven years, or with fine, or with both.\n\nIllustration\n\nA, on grave and sudden provocation, fires a pistol at Z, under such circumstances that if he there by caused death he would\nbe guilty of culpable homicide not amounting to murder. A has committed the offence defined in this section.\n\n309. Attempt to commit suicide——Whoever attempts to commit suicide and does any act towards\nthe commission of such offence, shall be punished with simple imprisonment for a term which may\nextend to one year “[or with fine, or with both]\n\n310. Thug. —Whoever, at any time after the passing of this Act, shall have been habitually associated\nwith any other or others for the purpose of committing robbery or child-stealing by means of or\naccompanied with murder, is a thug.\n\n311. Punishment.—Whoever is a thug, shall be punished with “[imprisonment for life], and shall also\nbe liable to fine.\n\nOf the causing of miscarriage, of injuries to unborn children, of the exposure\nOf infants, and of the concealment of births.\n\n312. Causing miscarraige—Whoever voluntarily causes a woman with child to miscarry, shall, if\nsuch miscarriage be not caused in good faith for the purpose of saving the life of the woman, be punished\nwith imprisonment of either description for a term which may extend to three years, or with fine, or with\nboth; and, if the woman be quick with child, shall be punished with imprisonment of either description for\na term which may extend to seven years, and shall also be liable to fine.\n\nExplanation —A woman who causes herself to miscarry, is within the meaning of this section.\n\n313. Causing miscarriage without woman's consent.—Whoever commits the offence defined in\nthe last preceding section without the consent of the woman, whether the woman is quick with child or\nnot, shall be punished with “[imprisonment for life], or with imprisonment of either description for a term\nwhich may extend to ten years, and shall also be liable to fine.\n\n314. Death caused by act done with intent to cause miscarriage ——Whoever, with intent to cause\nthe miscarriage of a woman with child, does any act which causes the death of such woman, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine;\n\n1. Added by Act 27 of 1870, s. 11.\n\n2. Ins. by Act 12 of 1891, s. 2 and the Second Sch.\n\n3. Subs. by Act 8 of 1882, s. 7, for “and shall also be liable to fine”.\n\n4. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n72\n\n\nif act done without woman's consent.—and if the act is done without the consent of the woman,\nshall be punished either with '[imprisonment for life], or with the punishment above mentioned.\n\nExplanation.—It is not essential to this offence that the offender should know that the act is likely to\ncause death.\n\n315. Act done with intent to prevent child being born alive or to cause it to die after birth —\nWhoever before the birth of any child does any act with the intention of thereby preventing that child\nfrom being born alive or causing it to die after its birth, and does by such act prevent that child from being\nborn alive, or causes it to die after its birth, shall, if such act be not caused in good faith for the purpose of\nsaving the life of the mother, be punished with imprisonment of either description for a term which may\nextend to ten years, or with fine, or with both.\n\n316. Causing death of quick unborn child by act amounting to culpable homicide —Whoever\ndoes any act under such circumstances, that if he thereby caused death he would be guilty of culpable\nhomicide, and does by such act cause the death of a quick unborn child, shall be punished with\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\nIllustration\n\nA, knowing that he is likely to cause the death of a pregnant woman, does an act which, if it caused the death of the woman,\nwould amount to culpable homicide. The woman is injured, but does not die; but the death of an unborn quick child with which\nshe is pregnant is thereby caused. A is guilty of the offence defined in this section.\n\n317. Exposure and abandonment of child under twelve years, by parent or person having care\nof it —Whoever being the father or mother of a child under the age of twelve years, or having the care of\nsuch child, shall expose or leave such child in any place with the intention of wholly abandoning such\nchild, shall be punished with imprisonment of either description for a term which may extend to seven\nyears, or with fine, or with both.\n\nExplanation.—This section is not intended to prevent the trial of the offender for murder or culpable\nhomicide, as the case may be, if the child die in consequence of the exposure.\n\n318. Concealment of birth by secret disposal of dead body.—Whoever, by secretly burying or\notherwise disposing of the dead body of a child whether such child die before or after or during its birth,\nintentionally conceals or endeavors to conceal the birth of such child, shall be punished with\nimprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\nOf Hurt\n\n319. Hurt— Whoever causes bodily pain, disease or infirmity to any person is said to cause hurt.\n320. Grievous hurt.—The following kinds of hurt only are designated as “grievous” :—\n\nFirst—Emasculation.\n\nSecondly.—Permanent privation of the sight of either eye.\n\nThirdly —Permanent privation of the hearing of either ear.\n\nFourthly —Privation of any member or joint.\n\nFifthly —Destruction or permanent impairing of the powers of any member or joint.\n\nSixthly—Permanent disfiguration of the head or face.\n\nSeventhly.—Fracture or dislocation of a bone or tooth.\n\nEighthly—Any hurt which endangers life or which causes the sufferer to be during the space of\ntwenty days in severe bodily pain, or unable to follow his ordinary pursuits.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n73\n\n\n321. Voluntarily causing hurt—Whoever does any act with the intention of thereby causing hurt to\nany person, or with the knowledge that he is likely thereby to cause hurt to any person, and does thereby\ncause hurt to any person, is said “voluntarily to cause hurt”.\n\n322. Voluntarily causing grievous hurt——Whoever voluntarily causes hurt, if the hurt which he\nintends to cause or knows himself to be likely to cause is grievous hurt, and if the hurt which he causes is\ngrievous hurt, is said “voluntarily to cause grievous hurt”.\n\nExplanation.—A person is not said voluntarily to cause grievous hurt except when he both causes\ngrievous hurt and intends or knows himself to be likely to cause grievous hurt. But he is said voluntarily\nto cause grievous hurt, if intending or knowing himself to be likely to cause grievous hurt of one kind, he\nactually causes grievous hurt of another kind.\n\nIllustration\n\nA, intending of knowing himself to be likely permanently to disfigure Z's face, gives Z a blow which does not permanently\ndisfigure Z's face, but which causes Z to suffer severe bodily pain for the space of twenty days. A has voluntarily caused grievous\nhurt.\n\n323. Punishment for voluntarily causing hurt—Whoever, except in the case provided for by",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  },
  {
    "section": "334",
    "title": ", voluntarily causes hurt, shall be punished with imprisonment of either description for a term",
    "raw_text": "which may extend to one year, or with fine which may extend to one thousand rupees, or with both.\n\n324. Voluntarily causing hurt by dangerous weapons or means.—Whoever, except in the case\nprovided for by section 334, voluntarily causes hurt by means of any instrument for shooting, stabbing or\ncutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire\nor any heated substance, or by means of any poison or any corrosive substance, or by means of any\nexplosive substance or by means of any substance which it is deleterious to the human body to inhale, to\nswallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment of\neither description for a term which may extend to three years, or with fine, or with both.\n\n325. Punishment for voluntarily causing grievous hurt.—Whoever, except in the case provided for\nby section 335, voluntarily causes grievous hurt, shall be punished with imprisonment of either\ndescription for a term which may extend to seven years, and shall also be liable to fine.\n\n326. Voluntarily causing grievous hurt by dangerous weapons or means.—Whoever, except in\nthe case provided for by section 335, voluntarily causes grievous hurt by means of any instrument for\nshooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause\ndeath, or by means of fire or any heated substance, or by means of any poison or any corrosive substance,\nor by means of any explosive substance, or by means of any substance which it is deleterious to the\nhuman body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be\npunished with '[imprisonment for life], or with imprisonment of either description for a term which may\nextend to ten years, and shall also be liable to fine.\n\n71326A. Voluntarily causing grievous hurt by use of acid, ete——Whoever causes permanent or\npartial damage or deformity to, or burns or maims or disfigures or disables, any part or parts of the body\nof a person or causes grievous hurt by throwing acid on or by administering acid to that person, or by\nusing any other means with the intention of causing or with the knowledge that he is likely to cause such\ninjury or hurt, shall be punished with imprisonment of either description for a term which shall not be less\nthan ten years but which may extend to imprisonment for life, and with fine:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses of the treatment of\nthe victim:\n\nProvided further that any fine imposed under this section shall be paid to the victim.\n\n326B. Voluntarily throwing or attempting to throw acid — Whoever throws or attempts to throw\nacid on any person or attempts to administer acid to any person, or attempts to use any other means, with\nthe intention of causing permanent or partial damage or deformity or burns or maiming or disfigurement\nor disability or grievous hurt to that person, shall be punished with imprisonment of either description for\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n2. Ins. by Act 13 of 2013, s. 5 (w.e.f. 3-2-2013).\n\n74\n\n\na term which shall not be less than five years but which may extend to seven years, and shall also be\nliable to fine.\n\nExplanation 1.—For the purposes of section 326A and this section, \"acid\" includes any substance\nwhich has acidic or corrosive character or burning nature, that is capable of causing bodily injury leading\nto scars or disfigurement or temporary or permanent disability.\n\nExplanation 2.—For the purposes of section 326A and this section, permanent or partial damage or\ndeformity shall not be required to be irreversible. |\n\n327. Voluntarily causing hurt to extort property, or to constrain to an illegal to an act.—\nWhoever voluntarily causes hurt, for the purpose of extorting from the sufferer, or from any person\ninterested in the sufferer, any property or valuable security, or of constraining the sufferer or any person\ninterested in such sufferer to do anything which is illegal or which may facilitate the commission of an\noffence, shall be punished with imprisonment of either description for a term which may extend to ten\nyears, and shall also be liable to fine.\n\n328. Causing hurt by means of poison, etc., with intent to commit and offence —Whoever\nadministers to or causes to be taken by any person any poison or any stupefying, intoxicating or\nunwholesome drug, or other thing with intent to cause hurt to such person, or with intent to commit or to\nfacilitate the commission of an offence or knowing it to be likely that he will thereby cause hurt, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\n329. Voluntarily causing grievous hurt to extort property, or to constrain to an illegal act —\nWhoever voluntarily causes grievous hurt for the purpose of extorting from the sufferer or from any\nperson interested in the sufferer any property or valuable security, or of constraining the sufferer or any\nperson interested in such sufferer to do anything that is illegal or which may facilitate the commission of\nan offence, shall be punished with '[imprisonment for life], or imprisonment of either description for a\nterm which may extend to ten years, and shall also be liable to fine.\n\n330. Voluntarily causing hurt to extort confession, or to compel restoration of property.—\nWhoever voluntarily causes hurt, for the purpose of extorting from the sufferer or from any person\ninterested in the sufferer, any confession or any information which may lead to the detection of an offence\nor misconduct, or for the purpose of constraining the sufferer or any person interested in the sufferer to\nrestore or to cause the restoration of any property or valuable security or to satisfy any claim or demand,\nor to give information which may lead to the restoration of any property or valuable security, shall be\npunished with imprisonment of either description for a term which may extend to seven years, and shall\nalso be liable to fine.\n\nIllustrations\n\n(a) A, a police-officer, tortures Z in order to induce Z to confess that he committed a crime. A is guilty of an offence under\nthis section.\n\n(b) A, a police-officer, tortures B to induce him to point out where certain stolen property is deposited. A is guilty of an\noffence under this section.\n\n(c) A, a revenue officer, tortures Z in order to compel him to pay certain arrears of revenue due from Z. A is guilty of an\noffence under this section.\n\n(d) A, a zamindar, tortures a raiyat in order to compel him to pay his rent. A is guilty of an offence under this section.\n\n331. Voluntarily causing grievous hurt to extort confession, or to compel restoration of\nproperty.—Whoever voluntarily causes grievous hurt for the purpose of extorting from the sufferer or\nfrom any person interested in the sufferer any confession or any information which may lead to the\ndetection of an offence or misconduct, or for the purpose of constraining the sufferer or any person\ninterested in the sufferer to restore or to cause the restoration of any property or valuable security, or to\nsatisfy any claim or demand or to give information which may lead to the restoration of any property or\nvaluable security, shall be punished with imprisonment of either description for a term which may extend\nto ten years, and shall also be liable to fine.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n75\n\n\n332. Voluntarily causing hurt to deter public servant from his duty —Whoever voluntarily causes\nhurt to any person being a public servant in the discharge of his duty as such public servant, or with intent\nto prevent or deter that person or any other public servant from discharging his duty as such public\nservant or in consequence of anything done or attempted to be done by that person in the lawful discharge\nof his duty as such public servant, shall be punished with imprisonment of either description for a term\nwhich may extend to three years, or with fine, or with both.\n\n333. Voluntarily causing grievous hurt to deter public servant from his duty Whoever\nvoluntarily causes grievous hurt to any person being a public servant in the discharge of his duty as such\npublic servant, or with intent to prevent or deter that person or any other public servant from discharging\nhis duty as such public servant, or in consequence of anything done or attempted to be done by that\nperson in the lawful discharge of his duty as such public servant, shall be punished with imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine.\n\n334. Voluntarily causing hurt on provocation—Whoever voluntarily causes hurt on grave and\nsudden provocation, if he neither intends nor knows himself to be likely to cause hurt to any person other\nthan the person who gave the provocation, shall be punished with imprisonment of either description for a\nterm which may extend to one month, or with fine which may extend to five hundred rupees, or with both.\n\n335. Voluntarily causing grievous hurt on provocation—Whoever '[voluntarily] causes grievous\nhurt on grave and sudden provocation, if he neither intends nor knows himself to be likely to cause\ngrievous hurt to any person other than the person who gave the provocation, shall be punished with\nimprisonment of either description for a term which may extend to four years, or with fine which may\nextend to two thousand rupees, or with both.\n\nExplanation.—The last two sections are subject to the same provisos as Exception 1, section 300.\n\n336. Act endangering life or personal safety of others—Whoever does any act so rashly or\nnegligently as to endanger human life or the personal safety of others, shall be punished with\nimprisonment of either description for a term which may extend to three months or with fine which may\nextend to two hundred and fifty rupees, or with both.\n\n337. Causing hurt by act endangering life or personal safety of others —Whoever causes hurt to\nany person by doing any act so rashly or negligently as to endanger human life, or the personal safety of\nothers, shall be punished with imprisonment of either description for a term which may extend to six\nmonths, or with fine which may extend to five hundred rupees, or with both.\n\n338. Causing grievous hurt by act endangering life or personal safety of others —Whoever\ncauses grievous hurt to any person by doing any act so rashly or negligently as to endanger human life, or\nthe personal safety of others, shall be punished with imprisonment of either description for a term which\nmay extend to two years, or with fine which may extend to one thousand rupees, or with both.\n\nOf wrongful restraint and wrongful confinement\n\n339. Wrongful restraint —Whoever voluntarily obstructs any person so as to prevent that person\nfrom proceeding in any direction in which that person has a right to proceed, is said wrongfully to restrain\nthat person.\n\nException—tThe obstruction of a private way over land or water which a person in good faith\nbelieves himself to have a lawful right to obstruct, is not an offence within the meaning of this section.\n\nIllustration\n\nA obstructs a path along which Z has a right to pass, A not believing in good faith that he has a right to stop the path. Z is\nthereby prevented from passing. A wrongfully restrains Z.\n\n340. Wrongful confinement—Whoever wrongfully restrains any person in such a manner as to\nprevent that person from proceedings beyond certain circumscribing limits, is said “wrongfully to\nconfine” that person.\n\n1. Ins. by Act 8 of 1882, s. 8.\n\n76\n\n\nIllustrations\n\n(a) A causes Z to go within a walled space, and locks Z in Z is thus prevented from proceeding in any\ndirection beyond the circumscribing line of wall. A wrongfully confines Z.\n\n(6) A places men with firearms at the outlets of a building, and tells Z that they will fire at Z if Z\nattempts leave the building. A wrongfully confines Z.\n\n341. Punishment for wrongful restraint—Whoever wrongfully restrains any person shall be\npunished with simple imprisonment for a term which may extend to one month, or with fine which may\nextend to five hundred rupees, or with both.\n\n342. Punishment for wrongful confinement.—Whoever wrongfully confines any person shall be\npunished with imprisonment of either description for a term which may extend to one year, or with fine\nwhich may extend to one thousand rupees, or with both.\n\n343. Wrongful confinement for three or more days——Whoever wrongfully confines any person for\nthree days, or more, shall be punished with imprisonment of either description for a term which may\nextend to two years, or with fine, or with both.\n\n344. Wrongful confinement for ten or more days—Whoever wrongfully confines any person for\nten days, or more, shall be punished with imprisonment of either description for a term which may extend\nto three years, and shall also be liable to fine.\n\n345. Wrongful confinement of person for whose liberation writ has been issued —Whoever\nkeeps any person in wrongful confinement, knowing that a writ for the liberation of that person has been\nduly issued, shall be punished with imprisonment of either description for a term which may extend to\ntwo years in addition to any term of imprisonment to which he may be liable under any other section of\nthis Chapter.\n\n346. Wrongful confinement in secret—Whoever wrongfully confines any person in such manner as\nto indicate an intention that the confinement of such person may not be known to any person interested in\nthe person so confined, or to any public servant, or that the place of such confinement may not be known\nto or discovered by any such person or public servant as hereinbefore mentioned, shall be punished with\nimprisonment of either description for a term which may extend to two years in addition to any other\npunishment to which he may be liable for such wrongful confinement.\n\n347. Wrongful confinement to extort property, or constrain to illegal act —Whoever wrongfully\nconfines any person for the purpose of extorting from the person confined, or from any person interested\nin the person confined, any property or valuable security or of constraining the person confined or any\nperson interested in such person to do anything illegal or to give any information which may facilitate the\ncommission of an offence, shall be punished with imprisonment of either description for a term which\nmay extend to three years, and shall also be liable to fine.\n\n348. Wrongful confinement to extort confession, or compel restoration of property —Whoever\nwrongfully confines any person for the purpose of extorting from the person confined or any person\ninterested in the person confined any confession or any information which may lead to the detection of an\noffence or misconduct, or for the purpose of constraining the person confined or any person interested in\nthe person confined to restore or to cause the restoration of any property or valuable security or to satisfy\nany claim or demand, or to give information which may lead to the restoration of any property or valuable\nsecurity, shall be punished with imprisonment of either description for a term which may extend to three\nyears, and shall also be liable to fine.\n\nOf Criminal Force and Assault\n\n349. Force.—A person is said to use force to another if he causes motion, change of motion, or\ncessation of motion to that other, or if he causes to any substance such motion, or change of motion, or\ncessation of motion as brings that substance into contact with any part of that other's body, or with\nanything which that other is wearing or carrying, or with anything so situated that such contact affects that\nother's sense of feeling: Provided that the person causing the motion, or change of motion, or cessation of\nmotion, causes that motion, change of motion, or cessation of motion in one of the three ways hereinafter\ndescribed:\n\n77\n\n\nFirst.—By his own bodily power.\n\nSecondly.—By disposing any substance in such a manner that the motion or change or cessation of\nmotion takes place without any further act on his part, or on the part of any other person.\n\nThirdly —By inducing any animal to move, to change its motion, or to cease to move.\n\n350. Criminal force —Whoever intentionally uses force to any person, without that person's consent,\nin order to the committing of any offence, or intending by the use of such force to cause, or knowing it to\nbe likely that by the use of such force he will cause injury, fear or annoyance to the person to whom the\nforce is used, is said to use criminal force to that other.\n\nIllustrations\n\n(a) Z is sitting in a moored boat on a river. A unfastens the moorings, and thus intentionally causes the boat to drift down the\nstream. Here A intentionally causes motion to Z, and he does this by disposing substances in such a manner that the motion is\nproduced without any other action on any person's part. A has therefore intentionally used force to Z; and if he has done so\nwithout Z's consent, in order to the committing of any offence, or intending or knowing it to be likely that this use of force will\ncause injury, fear or annoyance to Z, A has used criminal force to Z.\n\n(b) Z is riding in a chariot. A lashes Z's horses, and thereby causes them to quicken their pace. Here A has caused change of\nmotion to Z by inducing the animals to change their motion. A has therefore used force to Z; and if A has done this without Z's\nconsent, intending or knowing it to be likely that he may thereby injure, frighten or annoy Z, A has used criminal force to Z.\n\n(c) Z is riding in a palanquin. A, intending to rob Z, seizes the pole and stops the palanquin. Here A has caused cessation of\nmotion to Z, and he has done this by his own bodily power. A has therefore used force to Z; and as A has acted thus intentionally,\nwithout Z's consent, in order to the commission of an offence. A has used criminal force to Z.\n\n(d) A intentionally pushes against Z in the street. Here A has by his own bodily power moved his own person so as to bring\nit into contact with Z. He has therefore intentionally used force to Z; and if he has done so without Z's consent, intending or\nknowing it to be likely that he may thereby injure, frighten or annoy Z, he has used criminal force to Z.\n\n(e) A throws a stone, intending or knowing it to be likely that the stone will be thus brought into contact with Z, or with Z's\nclothes, or with something carried by Z, or that it will strike water and dash up the water against Z's clothes or something carried\nby Z. Here, if the throwing of the stone produce the effect of causing any substance to come into contact with Z, or Z's clothes, A\nhas used force to Z, and if he did so without Z's consent, intending thereby to injure, frighten or annoy Z, he has used criminal\nforce to Z.\n\n(f) A intentionally pulls up a Woman's veil. Here A intentionally uses force to her, and if he does so without her consent\nintending or knowing it to be likely that he may thereby injure, frighten or annoy her, he has used criminal force to her.\n\n(g) Z is bathing. A pours into the bath water which he knows to be boiling. Here A intentionally by his own bodily power\ncauses such motion in the boiling water as brings that water into contact with Z, or with other water so situated that such contact\nmust affect Z's sense of feeling; A has therefore intentionally used force to Z; and if he has done this without Z's consent\nintending or knowing it to be likely that he may thereby cause injury, fear or annoyance to Z, A has used criminal force.\n\n(A) A incites a dog to spring upon Z, without Z's consent. Here, if A intends to cause injury, fear or annoyance to Z, he uses\ncriminal force to Z.\n\n351. Assault—Whoever makes any gesture, or any preparation intending or knowing it to be likely\nthat such gesture or preparation will cause any person present to apprehend that he who makes that\ngesture or preparation is about to use criminal force to that person, is said to commit an assault.\n\nExplanation.—Mere words do not amount to an assault. But the words which a person uses may give\nto his gestures or preparation such a meaning as may make those gestures or preparations amount to an\nassault.\n\nIllustrations\n\n(a) A shakes his fist at Z, intending or knowing it to be likely that he may thereby cause Z to believe that A is about to strike\nZ. A has committed an assault.\n\n(b) A begins to unloose the muzzle of a ferocious dog, intending or knowing it to be likely that he may thereby cause Z to\nbelieve that he is about to cause the dog to attack Z. A has committed an assault upon Z.\n\n(c) A takes up a stick, saying to Z, “I will give you a beating”. Here, though the words used by A could in no case amount to\nan assault, and though the mere gesture, unaccompanied by any other circumstances, might not amount to an assault,the gesture\nexplained by the words may amount to an assault.\n\n352. Punishment for assault or criminal force otherwise than on grave provocation — Whoever\nassaults or uses criminal force to any person otherwise than on grave and sudden provocation given by\nthat person, shall be punished with imprisonment of either description for a term which may extend to\nthree months, or with fine which may extend to five hundred rupees, or with both.\n\n78\n\n\nExplanation.—Grave and sudden provocation will not mitigate the punishment for an offence under\nthis section, if the provocation is sought or voluntarily provoked by the offender as an excuse for the\noffence, or\n\nif the provocation is given by anything done in obedience to the law, or by a public servant, in the\nlawful exercise of the powers of such public servant, or\n\nif the provocation is given by anything done in the lawful exercise of the right of private defence.\nWhether the provocation was grave and sudden enough to mitigate the offence, is a question of fact.\n\n353. Assault or criminal force to deter public servant from discharge of his duty —Whoever\nassaults or uses criminal force to any person being a public servant in the execution of his duty as such\npublic servant, or with intent to prevent or deter that person from discharging his duty as such public\nservant, or in consequence of anything done or attempted to be done by such person to the lawful\ndischarge of his duty as such public servant, shall be punished with imprisonment of either description for\na term which may extend to two years, or with fine, or with both.\n\n354. Assault or criminal force to woman with intent to outrage her modesty — Whoever assaults\nor uses criminal force to any woman, intending to outrage or knowing it to be likely that he will there by\noutrage her modesty, '[shall be punished with imprisonment of either description for a term which shall not be less\nthan one year but which may extend to five years, and shall also be liable to fine].\n\n*[354A. Sexual harassment and punishment for sexual harassment—(/) Aman committing any\nof the following acts—\n\n(i) physical contact and advances involving unwelcome and explicit sexual overtures; or\n(ii) a demand or request for sexual favours; or\n(iii) showing pornography against the will of a woman; or\n(iv) making sexually coloured remarks,\nshall be guilty of the offence of sexual harassment.\n\n(2) Any man who commits the offence specified in clause (i) or clause (ii) or clause (iii) of\nsub-section (/) shall be punished with rigorous imprisonment for a term which may extend to three years,\nor with fine, or with both.\n\n(3) Any man who commits the offence specified in clause (iv) of sub-section (/) shall be punished\nwith imprisonment of either description for a term which may extend to one year, or with fine, or with\nboth.\n\n354B. Assault or use of criminal force to woman with intent to disrobe—Any man who assaults\nor uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to\nbe naked, shall be punished with imprisonment of either description for a term which shall not be less\nthan three years but which may extend to seven years, and shall also be liable to fine.\n\n354C. Voyeurism. Any man who watches, or captures the image of a woman engaging in a private\nact in circumstances where she would usually have the expectation of not being observed either by the\nperpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be\npunished on first conviction with imprisonment of either description for a term which shall not be less\nthan one year, but which may extend to three years, and shall also be liable to fine, and be punished on a\nsecond or subsequent conviction, with imprisonment of either description for a term which shall not be\nless than three years, but which may extend to seven years, and shall also be liable to fine.\n\nExplanation |.—For the purpose of this section, “private act” includes an act of watching carried out\nin a place which, in the circumstances, would reasonably be expected to provide privacy and where the\nvictim's genitals, posterior or breasts are exposed or covered only in underwear; or the victim is using a\nlavatory; or the victim is doing a sexual act that is not of a kind ordinarily done in public.\n\n1. Subs. by Act 13 of 2013, s. 6, for “shall be punished with imprisonment of either description for a term which may extend to two years, or\nwith fine, or with both” (w.e.f. 3-2-2013).\n2. Ins. by s. 7, ibid. (w.e.f. 3-2-2013).\n\n79\n\n\nExplanation 2—Where the victim consents to the capture of the images or any act, but not to their\ndissemination to third persons and where such image or act is disseminated, such dissemination shall be\nconsidered an offence under this section.\n\n354D. Stalking —(/) Any man who—\n\n(i) follows a woman and contacts, or attempts to contact such woman to foster personal\ninteraction repeatedly despite a clear indication of disinterest by such woman; or\n\n(ii) monitors the use by a woman of the internet, email or any other form of electronic\ncommunication,\n\ncommits the offence of stalking:\n\nProvided that such conduct shall not amount to stalking if the man who pursued it proves that—\n\n(i) it was pursued for the purpose of preventing or detecting crime and the man accused of\nstalking had been entrusted with the responsibility of prevention and detection of crime by the\nState; or\n\n(ii) it was pursued under any law or to comply with any condition or requirement imposed by\nany person under any law; or\n\n(iii) in the particular circumstances such conduct was reasonable and justified.\n\n(2) Whoever commits the offence of stalking shall be punished on first conviction with imprisonment\nof either description for a term which may extend to three years, and shall also be liable to fine; and be\npunished on a second or subsequent conviction, with imprisonment of either description for a term which\nmay extend to five years, and shall also be liable to fine.]\n\n355. Assault or criminal force with intent to dishonour person, otherwise than on grave\nprovocation. —Whoever assaults or uses criminal force to any person, intending thereby to dishonour\nthat person, otherwise than on grave and sudden provocation given by that person, shall be punished with\nimprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n356. Assault or criminal force in attempt to commit theft of property carried by a person —\nWhoever assaults or uses criminal force to any person, in attempting to commit theft on any property\nwhich that person is then wearing or carrying, shall be punished with imprisonment of either description\nfor a term which may extend to two years, or with fine, or with both.\n\n357. Assault or criminal force in attempt wrongfully to confine a person—Whoever assaults or\nuses criminal force to any person, in attempting wrongfully to confine that person, shall be punished with\nimprisonment of either description for a term which may extend to one year, or with fine which may\nextend to one thousand rupees, or with both.\n\n358. Assault or criminal force on grave provocation.—Whoever assaults or uses criminal force to\nany person on grave and sudden provocation given by that person, shall be punished with simple\nimprisonment for a term which may extend to one month, or with fine which may extend to two hundred\nrupees, or with both.\n\nExplanation.—The last section is subject to the same Explanation as section 352.\n\nOf Kidnapping, Abduction, Slavery and Forced Labour\n\n359. Kidnapping —Kidnapping is of two kinds: kidnapping from ‘[India], and kidnapping from\nlawful guardianship.\n\n360. Kidnapping from India —Whoever conveys any person beyond the limits of '[India] without\nthe consent of that person, or of some person legally authorised to consent on behalf of that person, is said\nto kidnap that person from '[India].\n\n361. Kidnapping from lawful guardianship —Whoever takes or entices any minor under “[sixteen]\nyears of age if a male, or under *[eighteen] years of age if a female, or any person of unsound mind, out of\nthe keeping of the lawful guardian of such minor or person of unsound mind, without the consent of such\nguardian, is said to kidnap such minor or person from lawful guardianship.\n\n1. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n2. Subs. by Act 42 of 1949, s. 2, for “fourteen”.\n\n3. Subs. by s. 2, ibid., for “sixteen”.\n\n80\n\n\nExplanation —The words “lawful guardian” in this section include any person lawfully entrusted\nwith the care or custody of such minor or other person.\n\nException.—This section does not extend to the act of any person who in good faith believes himself\nto be the father of an illegitimate child, or who in good faith believes himself to be entitled to the lawful\ncustody of such child, unless such act is committed for an immoral or unlawful purpose.\n\n362. Abduction —Whoever by force compels, or by any deceitful means induces, any person to go\nfrom any place, is said to abduct that person.\n\n363. Punishment for kidnapping —Whoever kidnaps any person from ‘[India] or from lawful\nguardianship, shall be punished with imprisonment of either description for a term which may extend to\nseven years, and shall also be liable to fine.\n\n7[363A. Kidnapping or maiming a minor for purposes of begging —(/) Whoever kidnaps any\nminor or, not being the lawful guardian of a minor, obtains the custody of the minor, in order that such\nminor may be employed or used for the purposes of begging shall be punishable with imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine.\n\n(2) Whoever maims any minor in order that such minor may be employed or used for the purposes of\nbegging shall be punishable with imprisonment for life, and shall also be liable to fine.\n\n(3) Where any person, not being the lawful guardian of a minor, employs or uses such minor for the\npurposes of begging, it shall be presumed, unless the contrary is proved, that he kidnapped or otherwise\nobtained the custody of that minor in order that the minor might be employed or used for the purposes of\nbegging.\n\n(4) In this section,—\n\n(a) “begging” means—\n\n(7) soliciting or receiving alms in a public place, whether under the pretence of singing,\ndancing, fortunetelling, performing tricks or selling articles or otherwise;\n\n(ii) entering on any private premises for the purpose of soliciting or receiving alms;\n\n(iii) exposing or exhibiting, with the object of obtaining or extorting alms, any sore, wound,\ninjury, deformity or disease, whether of himself or of any other person or of an animal;\n\n(iv) using a minor as an exhibit for the purpose of soliciting or receiving alms;\n(6) “minor” means—\n\n(z) in the case of a male, a person under sixteen years of age; and\n\n(ii) in the case of a female, a person under eighteen years of age. ]\n\n364. Kidnapping or abducting in order to murder.—Whoever kidnaps or abducts any person in\norder that such person may be murdered or may be so disposed of as to be put in danger of being\nmurdered, shall be punished with *[imprisonment for life] or rigorous imprisonment for a term which may\nextend to ten years, and shall also be liable to fine.\n\nI[lustrations\n\n(a) A kidnaps Z from '[India], intending or knowing it to be likely that Z may be sacrificed to an idol. A has committed the\noffence defined in this section.\n\n(b) A forcibly carries or entices B away from his home in order that B may be murdered. A has committed the offence\ndefined in this section.\n\n*1364A. Kidnapping for ransom, ete —Whoever kidnaps or abducts any person or keeps a person in\ndetention after such kidnapping or abduction, and threatens to cause death or hurt to such person, or by\nhis conduct gives rise to a reasonable apprehension that such person may be put to death or hurt, or causes\nhurt or death to such person in order to compel the Government or *[any foreign State or international\n\n1. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n2. Ins. by Act 52 of 1959, s. 2 (w.e.f. 15-1-1960).\n\n3. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n4. Ins. by Act 42 of 1993, s. 2.\n\n5. Subs. by Act 24 of 1995, s. 2, for “any other person”.\n\n81\n\n\ninter-governmental organisation or any other person] to do or abstain from doing any act or to pay a\nransom, shall be punishable with death, or imprisonment for life, and shall also be liable to fine. ]\n\n365. Kidnapping or abducting with intent secretly and wrongfully to confine person —Whoever\nkidnaps or abducts any person with intent to cause that person to be secretly and wrongfully confined,\nshall be punished with imprisonment of either description for a term which may extend to seven years,\nand shall also be liable to fine.\n\n366. Kidnapping, abducting or inducing woman to compel her marriage, ete —Whoever kidnaps\nor abducts any woman with intent that she may be compelled, or knowing it to be likely that she will be\ncompelled, to marry any person against her will, or in order that she may be forced or seduced to illicit\nintercourse, or knowing it to be likely that she will be forced or seduced to illicit intercourse, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine; 'Tand whoever, by means of criminal intimidation as defined in this Code or of abuse of\nauthority or any other method of compulsion, induces any woman to go from any place with intent that\nshe may be, or knowing that it is likely that she will be, forced or seduced to illicit intercourse with\nanother person shall also be punishable as aforesaid].\n\n*[366A. Procuration of minor girl—Whoever, by any means whatsoever, induces any minor girl\nunder the age of eighteen years to go from any place or to do any act with intent that such girl may be, or\nknowing that it is likely that she will be, forced or seduced to illicit intercourse with another person shall\nbe punishable with imprisonment which may extend to ten years, and shall also be liable to fine.\n\n366B. Importation of girl from foreign country.—Whoever imports into *[India] from any country\noutside India “[or from the State of Jammu and Kashmir] any girl under the age of twenty-one years with\nintent that she may be, or knowing it to be likely that she will be, forced or seduced to illicit intercourse\nwith another person, °*** shall be punishable with imprisonment which may extend to ten years and shall\nshall also be liable to fine. |\n\n367. Kidnapping or abducting in order to subject person to grievous hurt, slavery, etc.—\nWhoever kidnaps or abducts any person in order that such person may be subjected, or may be so\ndisposed of as to be put in danger of being subjected to grievous hurt, or slavery, or to the unnatural lust\nof any person, or knowing it to be likely that such person will be so subjected or disposed of, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\n368. Wrongfully concealing or keeping in confinement, kidnapped or abducted person.—\nWhoever, knowing that any person has been kidnapped or has been abducted, wrongfully conceals or\nconfines such person, shall be punished in the same manner as if he had kidnapped or abducted such\nperson with the same intention or knowledge, or for the same purpose as that with or for which he\nconceals or detains such person in confinement.\n\n369. Kidnapping or abducting child under ten years with intent to steal from its person.—\nWhoever kidnaps or abducts any child under the age of ten years with the intention of taking dishonestly\nany movable property from the person of such child, shall be punished with imprisonment of either\ndescription for a term which may extend to seven years, and shall also be liable to fine.\n\n°[370. Trafficking of person —/(/) Whoever, for the purpose of exploitation, (a) recruits, (b) transports,\n(c) harbours, (d) transfers, or (e) receives, a person or persons, by—\n\nFirst.—using threats, or\n\n1. Added by Act 20 of 1923, s. 2.\n\n2. Ins. by s. 3, ibid.\n\n3. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n4. Ins. by Act 3 of 1951, s. 3 and the Sch.\n\n5. Certain words omitted by s. 3 and the Sch., ibid.\n\n6. Subs. by Act 13 of 2013, s. 8, for section 370 (w.e.f. 3-2-2013).\n\n82\n\n\nSecondly.—using force, or any other form of coercion, or\nThirdly.—by abduction, or\n\nFourthly.—by practising fraud, or deception, or\nFifthly.—by abuse of power, or\n\nSixthly.— by inducement, including the giving or receiving of payments or benefits, in order to achieve\nthe consent of any person having control overthe person recruited, transported, harboured, transferred or\nreceived,\n\ncommits the offence of trafficking.\n\nExplanation 1.—The expression \"exploitation\" shall include any act of physical exploitation or any form\nof sexual exploitation, slavery or practices similar to slavery, servitude, or the forced removal of organs.\n\nExplanation 2.—Theconsent of the victim is immaterial in determination of the offence of\ntrafficking.\n\n(2)Whoever commits the offence of trafficking shall be punished with rigorous imprisonment for a\nterm which shall not be less than seven years, but which may extend to ten years, and shall also be liable\nto fine.\n\n(3) Where the offence involves the trafficking of more than one person, it shall be punishable with rigorous\nimprisonment for a term which shall not be less than ten years but which may extend to imprisonment for life, and\nshall also be liable to fine.\n\n(4) Where the offence involves the trafficking of a minor, it shall be punishable with rigorous imprisonment for\na term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable\nto fine.\n\n(5) Where the offence involves the trafficking of more than one minor, it shall be punishable with\nrigorous imprisonment for a term which shall not be less than fourteen years, but which may extend to\nimprisonment for life, and shall also be liable to fine.\n\n(6) If a person is convicted of the offence of trafficking of minor on more than one occasion, then\nsuch person shall be punished with imprisonment for life, which shall mean imprisonment for the\nremainder of that person's natural life, and shall also be liable to fine.\n\n(7) When a public servant or a police officer is involved in the trafficking of any person then, such\npublic servant or police officer shall be punished with imprisonment for life, which shall mean\nimprisonment for the remainder of that person's natural life, and shall also be liable to fine.\n\n370A. Exploitation of a trafficked person.—(/) Whoever, knowingly or having reason to believe\nthat a minor has been trafficked, engages such minor for sexual exploitation in any manner, shall be\npunished with rigorous imprisonment for a term which shall not be less than five years, but which may\nextend to seven years, and shall also be liable to fine.\n\n(2) Whoever, knowingly by or having reason to believe that a person has been trafficked, engages\nsuch person for sexual exploitation in any manner, shall be punished with rigorous imprisonment for a\nterm which shall not be less than three years, but which may extend to five years, and shall also be liable\nto fine. ]\n\n371. Habitual dealing in slaves —Whoever habitually imports, exports, removes, buys, sells, traffics\nor deals in slaves, shall be punished with '[imprisonment for life], or with imprisonment of either\ndescription for a term not exceeding ten years, and shall also be liable to fine.\n\n372. Selling minor for purposes of prostitution, etec—Whoever sells, lets to hire, or otherwise\ndisposes of any “[person under the age of eighteen years with intent that such person shall at any age be\nemployed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful\nand immoral purpose, or knowing it to be likely that such person will at any age be] employed or used for\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life”.\n2. Subs. by Act 18 of 1924, s. 2, for certain words.\n\n83\n\n\nany such purpose, shall be punished with imprisonment of either description for a term which may extend\nto ten years, and shall also be liable to fine.\n\n'[Explanation I—When a female under the age of eighteen years is sold, let for hire, or otherwise\ndisposed of to a prostitute or to any person who keeps or manages a brothel, the person so disposing of\nsuch female shall, until the contrary is proved, be presumed to have disposed of her with the intent that\nshe shall be used for the purpose of prostitution.\n\nExplanation I1—For the purposes of this section “illicit intercourse” means sexual intercourse\nbetween persons not united by marriage or by any union or tie which, though not amounting to a\nmarriage, is recognised by the personal law or custom of the community to which they belong or, where\nthey belong to different communities, of both such communities, as constituting between them a quasi-\nmarital relation. ]\n\n373. Buying minor for purposes of prostitution, ete —Whoever buys, hires or otherwise obtains\npossession of any [person under the age of eighteen years with intent that such person shall at any age be\nemployed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful\nand immoral purpose, or knowing it to be likely that such person will at any age be] employed or used for\nany such purpose, shall be punished with imprisonment of either description for a term which may extend\nto ten years, and shall also be liable to fine.\n\n*[Explanation I.—Any prostitute or any person keeping or managing a brothel, who buys, hires or\notherwise obtains possession of a female under the age of eighteen years shall, until the contrary is\nproved, be presumed to have obtained possession of such female with the intent that she shall be used for\nthe purpose of prostitution.\n\nExplanation IT—“Tllicit intercourse” has the same meaning as in section 372.]\n\n374. Unlawful compulsory labour —Whoever unlawfully compels any person to labour against the\nwill of that person, shall be punished with imprisonment of either description for a term which may\nextend to one year, or with fine, or with both.\n\n“(Sexual offences\n°[375. Rape._—A man is said to commit “rape” if he—\n\n(a) penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or\nmakes her to do so with him or any other person; or\n\n(b) inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the\nurethra or anus of a woman or makes her to do so with him or any other person; or\n\n(c) manipulates any part of the body of a woman so as to cause penetration into the vagina,\nurethra, anus or any part of body of such woman or makes her to do so with him or any other person;\nor\n\n(d) applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or\nany other person,\n\nunder the circumstances falling under any of the following seven descriptions: —\nFirst——Against her will.\nSecondly.—Without her consent.\n\nThirdly.—With her consent, when her consent has been obtained by putting her or any person in\nwhom she is interested, in fear of death or of hurt.\n\nFourthly—wWith her consent, when the man knows that he is not her husband and that her\nconsent is given because she believes that he is another man to whom she is or believes herself to be\nlawfully married.\n\n1. Added by Act 18 of 1924, s. 3\n\n2. Subs. by s. 2, ibid., for certain words.\n\n3. Added by s. 4, ibid.\n\n4. Subs. by Act 43 of 1983, s. 3, for the heading “Of rape” and ss. 375 and 376.\n\n5. Subs. by Act 13 of 2013, s. 9, for sections 375, 376, 376A, 376B, 376C and 376D (w.e.f. 03-02-2013).\n\n84\n\n\nFifthly—With her consent when, at the time of giving such consent, by reason of unsoundness of\nmind or intoxication or the administration by him personally or through another of any stupefying or\nunwholesome substance, she is unable to understand the nature and consequences of that to which she\ngives consent.\n\nSixthly —With or without her consent, when she is under eighteen years of age.\nSeventhly—When she is unable to communicate consent.\nExplanation 1.—For the purposes of this section, “vagina” shall also include labia majora.\n\nExplanation 2.—Consent means an unequivocal voluntary agreement when the woman by words,\ngestures or any form of verbal or non-verbal communication, communicates willingness to participate in\nthe specific sexual act:\n\nProvided that a woman who does not physically resist to the act of penetration shall not by the reason\nonly of that fact, be regarded as consenting to the sexual activity.\n\nException 1—A medical procedure or intervention shall not constitute rape.\n\nException 2.—Sexual intercourse or sexual acts by a man with his own wife, the wife not being under\nfifteen years of age, is not rape.\n\n376. Punishment for rape—(/) Whoever, except in the cases provided for in sub-section (2),\ncommits rape, shall be punished with rigorous imprisonment of either description for a term which '[shall\nnot be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine].\n\n(2) Whoever,—\n(a) being a police officer, commits rape—\n(Z) within the limits of the police station to which such police officer is appointed; or\n(zi) in the premises of any station house; or\n\n(iii) on a woman in such police officer's custody or in the custody of a police officer\nsubordinate to such police officer; or\n\n(6) being a public servant, commits rape on a woman in such public servant's custody or in the\ncustody of a public servant subordinate to such public servant; or\n\n(c) being a member of the armed forces deployed in an area by the Central or a State Government\ncommits rape in such area; or\n\n(d) being on the management or on the staff of a jail, remand home or other place of custody\nestablished by or under any law for the time being in force or of a women's or children's institution,\ncommits rape on any inmate of such jail, remand home, place or institution; or\n\n(e) being on the management or on the staff of a hospital, commits rape on a woman in that\nhospital; or\n\n(f) being a relative, guardian or teacher of, or a person in a position of trust or authority towards\nthe woman, commits rape on such woman; or\n\n(g) commits rape during communal or sectarian violence; or\n\n(A) commits rape on a woman knowing her to be pregnant; or\n\n2 * * * *\n(7) commits rape, on a woman incapable of giving consent; or\n\n(k) being in a position of control or dominance over a woman, commits rape on such woman; or\n\n1. Subs. by Act 22 of 2018, s. 4, for “shall not be less than seven years, but which may extend to imprisonment for life, and shall\nalso be liable to fine” (w.e.f. 21-4-2018).\n2. Clause (7) omitted by s. 4, ibid. (w.e.f. 21-4-2018).\n\n85\n\n\n(/) commits rape on a woman suffering from mental or physical disability; or\n\n(m) while committing rape causes grievous bodily harm or maims or disfigures or endangers the\nlife of a woman; or\n\n(n) commits rape repeatedly on the same woman,\n\nshall be punished with rigorous imprisonment for a term which shall not be less than ten years, but which\nmay extend to imprisonment for life, which shall mean imprisonment for the remainder of that person's\nnatural life, and shall also be liable to fine.\n\nExplanation.—For the purposes of this sub-section,—\n\n(a) “armed forces” means the naval, military and air forces and includes any member of the\nArmed Forces constituted under any law for the time being in force, including the paramilitary forces\nand any auxiliary forces that are under the control of the Central Government or the State\nGovernment;\n\n(b) “hospital” means the precincts of the hospital and includes the precincts of any institution for\nthe reception and treatment of persons during convalescence or of persons requiring medical attention\nor rehabilitation;\n\n(c) “police officer” shall have the same meaning as assigned to the expression “police” under the\nPolice Act, 1861 (5 of 1861);\n\n(d) “women's or children's institution” means an institution, whether called an orphanage or a\nhome for neglected women or children or a widow's home or an institution called by any other name,\nwhich is established and maintained for the reception and care of women or children.\n\n'[(3) Whoever, commits rape on a woman under sixteen years of age shall be punished with\nrigorous imprisonment for a term which shall not be less than twenty years, but which may extend to\nimprisonment for life, which shall mean imprisonment for the remainder of that person's natural life,\nand shall also be liable to fine:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses and\nrehabilitation of the victim:\n\nProvided further that any fine imposed under this sub-section shall be paid to the victim. ]\n\n376A. Punishment for causing death or resulting in persistent vegetative state of victim.—\nWhoever, commits an offence punishable under sub-section (/) or sub-section (2) of section 376 and in\nthe course of such commission inflicts an injury which causes the death of the woman or causes the\nwoman to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term\nwhich shall not be less than twenty years, but which may extend to imprisonment for life, which shall\nmean imprisonment for the remainder of that person's natural life, or with death.\n\n*[376AB. Punishment for rape on woman under twelve years of age-—Whoever, commits rape on\na woman under twelve years of age shall be punished with rigorous imprisonment for a term which shall\nnot be less than twenty years, but which may extend to imprisonment for life, which shall mean\nimprisonment for the remainder of that person's natural life, and with fine or with death:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of\nthe victim:\n\nProvided further that any fine imposed under this section shall be paid to the victim. ]\n\n376B. Sexual intercourse by husband upon his wife during separation —Whoever has sexual\nintercourse with his own wife, who is living separately, whether under a decree of separation or\notherwise, without her consent, shall be punished with imprisonment of either description for a term\nwhich shall not be less than two years but which may extend to seven years, and shall also be liable to\nfine.\n\n1. Ins. by Act 22 of 2018, s. 4 (w.e.f. 21-4-2018).\n2. Ins. by s. 5, ibid., (w.e.f. 21-4-2018).\n\n86\n\n\nExplanation.—In this section, “sexual intercourse” shall mean any of the acts mentioned in clauses\n(a) to (d) of section 375.\n\n376C. Sexual intercourse by a person in authority —Whoever, being—\n(a) in a position of authority or in a fiduciary relationship; or\n(6) a public servant; or\n\n(c) superintendent or manager of a jail, remand home or other place of custody established by or\nunder any law for the time being in force, or a women's or children's institution; or\n\n(d) on the management of a hospital or being on the staff of a hospital,\n\nabuses such position or fiduciary relationship to induce or seduce any woman either in his custody or\nunder his charge or present in the premises to have sexual intercourse with him, such sexual intercourse\nnot amounting to the offence of rape, shall be punished with rigorous imprisonment of either description\nfor a term which shall not be less than five years, but which may extend to ten years, and shall also be\nliable to fine.\n\nExplanation 1.—In this section, “sexual intercourse” shall mean any of the acts mentioned in\nclauses (a) to (d) of section 375.\n\nExplanation 2.—For the purposes of this section, Explanation 1 to section 375 shall also be\napplicable.\n\nExplanation 3—“Superintendent’, in relation to a jail, remand home or other place of custody or\na women's or children's institution, includes a person holding any other office in such jail, remand\nhome, place or institution by virtue of which such person can exercise any authority or control over\nits inmates.\n\nExplanation 4.—The expressions “hospital” and “women's or children's institution” shall\nrespectively have the same meaning as in Explanation to sub-section (2) of section 376.\n\n376D. Gang rape—Where a woman is raped by one or more persons constituting a group or acting\nin furtherance of a common intention, each of those persons shall be deemed to have committed the\noffence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than\ntwenty years, but which may extend to life which shall mean imprisonment for the remainder of that\nperson's natural life, and with fine:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of\nthe victim:\n\nProvided further that any fine imposed under this section shall be paid to the victim.\n\n'[376DA. Punishment for gang rape on woman under sixteen years of age——Where a woman\nunder sixteen years of age is raped by one or more persons constituting a group or acting in furtherance of\na common intention, each of those persons shall be deemed to have committed the offence of rape and\nshall be punished with imprisonment for life, which shall mean imprisonment for the remainder of that\nperson's natural life, and with fine:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation\nof the victim:\n\nProvided further that any fine imposed under this section shall be paid to the victim.\n\n376DB. Punishment for gang rape on woman under twelve years of age-—Where a woman under\ntwelve years of age is raped by one or more persons constituting a group or acting in furtherance of a\ncommon intention, each of those persons shall be deemed to have committed the offence of rape and shall\nbe punished with imprisonment for life, which shall mean imprisonment for the remainder of that person's\nnatural life, and with fine, or with death:\n\nProvided that such fine shall be just and reasonable to meet the medical expenses and rehabilitation of\nthe victim:\n\n1. Ins. by Act 22 of 2018, s. 6 (w.e.f. 21-4-2018).\n\n87\n\n\nProvided further that any fine imposed under this section shall be paid to the victim. ]\n\n376E. Punishment for repeat offenders —Whoever has been previously convicted of an offence\npunishable under section 376 or section 376A or '[section 376AB or section 376D or section 376DA or",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  },
  {
    "section": "376",
    "title": "DB,] and is subsequently convicted of an offence punishable under any of the said sections",
    "raw_text": "shall be punished with imprisonment for life which shall mean imprisonment for the remainder of that\nperson's natural life, or with death.]]\n\nOf Unnatural Offences\n\n377. Unnatural offences—Whoever voluntarily has carnal intercourse against the order of nature\nwith any man, woman or animal, shall be punished with “[imprisonment for life], or with imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine.\n\nExplanation.—Penetration is sufficient to constitute the carnal intercourse necessary to the offence\ndescribed in this section.\n\nCHAPTER XVII\nOF OFFENCESAGAINST PROPERTY\nOf Theft\n\n378. Theft—Whoever, intending to take dishonestly any movable property out of the possession of\nany person without that person's consent, moves that property in order to such taking, is said to commit\ntheft.\n\nExplanation 1—A thing so long as it is attached to the earth, not being movable property, is not the\nsubject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth.\n\nExplanation 2—A moving effected by the same act which effects the severance may be a theft.\n\nExplanation 3 —A person is said to cause a thing to move by removing an obstacle which prevented\nit from moving or by separating it from any other thing, as well as by actually moving it.\n\nExplanation 4.—A person, who by any means causes an animal to move, is said to move that animal,\nand to move everything which, in consequence of the motion so caused, is moved by that animal.\n\nExplanation 5.—The consent mentioned in the definition may be express or implied, and may be\ngiven either by the person in possession, or by any person having for that purpose authority either express\nor implied.\n\nIllustrations\n\n(a) A cuts down a tree on Z's ground, with the intention of dishonestly taking the tree out of Z's possession without Z's\nconsent. Here, as soon as A has severed the tree in order to such taking, he has committed theft.\n\n(b) A puts a bait for dogs in his pocket, and thus induces Z's dog to follow it. Here, if A's intention be dishonestly to take the\ndog out of Z's possession without Z's consent, A has committed theft as soon as Z's dog has begun to follow A.\n\n(c) A meets a bullock carrying a box of treasure. He drives the bullock in a certain direction, in order that he may\ndishonestly take the treasure. As soon as the bullock begins to move, A has committed theft of the treasure.\n\n(d) A being Z's servant, and entrusted by Z with the care of Z's plate, dishonestly runs away with the plate, without Z's\nconsent. A has committed theft.\n\n(e) Z, going on a journey, entrusts his plate to A, the keeper of a warehouse, till Z shall return. A carries the plate to a\ngoldsmith and sells it. Here the plate was not in Z's possession. It could not therefore be taken out of Z's possession, and A has\nnot committed theft, though he may have committed criminal breach of trust.\n\n(f) A finds a ring belonging to Z on a table in the house which Z occupies. Here the ring is in Z's possession, and if A\ndishonestly removes it, A commits theft.\n\n(g) A finds a ring lying on the highroad, not in the possession of any person. A, by taking it, commits no theft, though he\nmay commit criminal misappropriation of property.\n\n(A) A sees a ring belonging to Z lying on a table in Z's house. Not venturing to misappropriate the ring immediately for fear\nof search and detection, A hides the ring in a place where it is highly improbable that it will ever be found by Z, with the\n\n1. Subs. by Act 22 of 2018, s. 7, for “section 376D” (w.e.f. 21-4-2018).\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n88\n\n\nintention of taking the ring from the hiding place and selling it when the loss is forgotten. Here A, at the time of first moving the\nring, commits theft.\n\n(7) A delivers his watch to Z, a jeweller, to be regulated. Z carries it to his shop. A, not owing to the jeweller any debt for\nwhich the jeweller might lawfully detain the watch as a security, enters the shop openly, takes his watch by force out of Z's hand,\nand carries it away. Here A, though he may have committed criminal trespass and assault, has not committed theft, inasmuch as\nwhat he did was not done dishonestly.\n\n(7) If A owes money to Z for repairing the watch, and if Z retains the watch lawfully as a security for the debt, and A takes\nthe watch out of Z's possession, with the intention of depriving Z of the property as a security for his debt, he commits theft,\ninasmuch as he takes it dishonestly.\n\n(k) Again, if A, having pawned his watch to Z, takes it out of Z's possession without Z's consent, not having paid what he\nborrowed on the watch, he commits theft, though the watch is his own property inasmuch as he takes it dishonestly.\n\n(J) A takes an article belonging to Z out of Z's possession without Z's consent, with the intention of keeping it until he\nobtains money from Z as a reward for its restoration. Here A takes dishonestly; A has therefor committed theft.\n\n(m) A, being on friendly terms with Z, goes into Z's library in Z's absence, and takes away a book without Z's express\nconsent for the purpose merely of reading it, and with the intention of returning it. Here, it is probable that A may have conceived\nthat he had Z's implied consent to use Z's book. If this was A's impression, A has not committed theft.\n\n(n) A asks charity from Z's wife. She gives A money, food and clothes, which A knows to belong to Z her husband. Here it\nis probable that A may conceive that Z's wife is authorised to give away alms. If this was A's impression, A has not committed\ntheft.\n\n(o) A is the paramour of Z's wife. She gives a valuable property, which A knows to belong to her husband Z, and to be such\nproperty as she has not authority from Z to give. If A takes the property dishonestly, he commits theft.\n\n(p) A, in good faith, believing property belonging to Z to be A's own property, takes that property out of B's possession.\nHere, as A does not take dishonestly, he does not commit theft.\n\n379. Punishment for theft —Whoever commits theft shall be punished with imprisonment of either\ndescription for a term which may extend to three years, or with fine, or with both.\n\n380. Theft in dwelling house, ete —Whoever commits theft in any building, tent or vessel, which\nbuilding, tent or vessel is used as a human dwelling, or used for the custody of property, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n381. Theft by clerk or servant of property in possession of master —Whoever, being a clerk or\nservant, or being employed in the capacity of a clerk or servant, commits theft in respect of any property\nin the possession of his master or employer, shall be punished with imprisonment of either description for\na term which may extend to seven years, and shall also be liable to fine.\n\n382. Theft after preparation made for causing death, hurt or restraint in order to the\ncommitting of the theft—Whoever commits theft, having made preparation for causing death, or hurt,\nor restraint, or fear of death, or of hurt, or of restraint, to any person, in order to the committing of such\ntheft, or in order to the effecting of his escape after the committing of such theft, or in order to the\nretaining of property taken by such theft, shall be punished with rigorous imprisonment for a term which\nmay extend to ten years, and shall also be liable to fine.\n\nIllustrations\n\n(a) A commits theft on property in Z's possession; and while committing this theft, he has a loaded pistol under his garment,\nhaving provided this pistol for the purpose of hurting Z in case Z should resist. A has committed the offence defined in this\nsection.\n\n(b) A picks Z's pocket, having posted several of his companions near him, in order that they may restrain Z, if Z should\nperceive what is passing and should resist, or should attempt to apprehend A. A has committed the offence defined in this section.\n\nOf Extortion\n\n383. Extortion Whoever intentionally puts any person in fear of any injury to that person, or to any\nother, and thereby dishonestly induces the person so put in fear to deliver to any person any property, or\nvaluable security or anything signed or sealed which may be converted into a valuable security, commits\n“extortion”.\n\nIllustrations\n\n(a) A threatens to publish a defamatory libel concerning Z unless Z gives him money. He thus induces Z to give him money.\nA has committed extortion.\n\n89\n\n\n(b) A threatens Z that he will keep Z's child in wrongful confinement, unless Z will sign and deliver to A a promissory note\nbinding Z to pay certain monies to A. Z sings and delivers the note. A has committed extortion.\n\n(c) A threatens to send club-men to plough up Z's field unless Z will sign and deliver to B a bond binding Z under a penalty\nto deliver certain produce to B, and thereby induces Z to sign and deliver the bond. A has committed extortion.\n\n(d) A, by putting Z in fear of grievous hurt, dishonestly induces Z to sign or affix his seal to a blank paper and deliver it to\nA. Z sings and delivers the paper to A. Here, as the paper so signed may be converted into a valuable security. A has committed\nextortion.\n\n384. Punishment for extortion Whoever commits extortion shall be punished with imprisonment\nof either description for a term which may extend to three years, or with fine, or with both.\n\n385. Putting person in fear of injury in order to commit extortion —Whoever, in order to the\ncommitting of extortion, puts any person in fear, or attempts to put any person in fear, of any injury, shall\nbe punished with imprisonment of either description for a term which may extend to two years, or with\nfine, or with both.\n\n386. Extortion by putting a person in fear of death or grievous hurt—Whoever commits\nextortion by putting any person in fear of death or of grievous hurt to that person or to any other, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\n387. Putting person in fear of death or of grievous hurt, in order to commit extortion —\nWhoever, in order to the committing of extortion, puts or attempts to put any person in fear of death or of\ngrievous hurt to that person or to any other, shall be punished with imprisonment of either description for\na term which may extend to seven years, and shall also be liable to fine.\n\n388. Extortion by threat of accusation of an offence punishable with death or imprisonment for\nlife, ete —Whoever commits extortion by putting any person in fear of an accusation against that person\nor any other, of having committed or attempted to commit any offence punishable with death, or with\n'[imprisonment for life], or with imprisonment for a term which may extend to ten years, or of having\nattempted to induce any other person to commit such offence, shall be punished with imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine; and, if the\noffence be one punishable under section 377 of this Code, may be punished with '[imprisonment for life].\n\n389. Putting person in fear or accusation of offence, in order to commit extortion —Whoever, in\norder to the committing of extortion, puts or attempts to put any person in fear of an accusation, against\nthat person or any other, of having committed, or attempted to commit, an offence punishable with death\nor with '[imprisonment for life], or with imprisonment for a term which may extend to ten years, shall be\npunished with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine; and, if the offence be punishable under section 377 of this Code, may be punished with\n[imprisonment for life].\n\nOf Robbery and Dacoity\n390. Robbery.—In all robbery there is either theft or extortion.\n\nWhen theft is robbery —tTheft is “robbery” if, in order to the committing of the theft, or in\ncommitting the theft, or in carrying away or attempting to carry away property obtained by the theft, the\noffender, for that end voluntarily causes or attempts to cause to any person death or hurt or wrongful\nrestraint, or fear of instant death or of instant hurt, or of instant wrongful restraint.\n\nWhen extortion is robbery —Extortion is “robbery” if the offender, at the time of committing the\nextortion, is in the presence of the person put in fear, and commits the extortion by putting that person in\nfear of instant death, of instant hurt, or of instant wrongful restraint to that person or to some other person,\nand, by so putting in fear, induces the person so put in fear then and there to deliver up the thing extorted.\n\nExplanation.—The offender is said to be present if he is sufficiently near to put the other person in\nfear of instant death, of instant hurt, or of instant wrongful restraint.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n90\n\n\nIllustrations\n\n(a) A holds Z down, and fraudulently takes Z's money and jewels from Z's clothes, without Z's consent. Here A has\ncommitted theft, and, in order to the committing of that theft, has voluntarily caused wrongful restraint to Z. A has therefore\ncommitted robbery.\n\n(b) A meets Z on the high road, shows a pistol, and demands Z's purse. Z, in consequence, surrenders his purse. Here A has\nextorted the purse from Z by putting him in fear of instant hurt, and being at the time of committing the extortion in his presence.\nA has therefore committed robbery.\n\n(c) A meets Z and Z's child on the high road. A takes the child, and threatens to filing it down a precipice, unless Z delivers\nhis purse. Z, in consequence, delivers his purse. Here A has extorted the purse from Z, by causing Z to be in fear of instant hurt to\nthe child who is there present. A has therefore committed robbery on Z.\n\n(d) A obtains property from Z by saying “Your child is in the hands of my gang, and will be put to death unless you send us\nten thousand rupees”. This is extortion, and punishable as such: but it is not robbery, unless Z is put in fear of the instant death of\nhis child.\n\n391. Dacoity—When five or more persons conjointly commit or attempt to commit a robbery, or\nwhere the whole number of persons conjointly committing or attempting to commit a robbery, and\npersons present and aiding such commission or attempt, amount to five or more, every person so\ncommitting, attempting or aiding, is said to commit “dacoity”.\n\n392. Punishment for robbery—Whoever commits robbery shall be punished with rigorous\nimprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery\nbe committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen\nyears.\n\n393. Attempt to commit robbery—Whoever attempts to commit robbery shall be punished with\nrigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.\n\n394. Voluntarily causing hurt in committing robbery—If any person, in committing or in\nattempting to commit robbery, voluntarily causes hurt, such person, and any other person jointly\nconcerned in committing or attempting to commit such robbery, shall be punished with '[imprisonment\nfor life], or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable\nto fine.\n\n395. Punishment for dacoity —Whoever commits dacoity shall be punished with '[imprisonment for\nlife], or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to\nfine.\n\n396. Dacoity with murder.—If any one of five or more persons, who are conjointly committing\ndacoity, commits murder in so committing dacoity, every one of those persons shall be punished with\ndeath, or '[imprisonment for life], or rigorous imprisonment for a term which may extend to ten years,\nand shall also be liable to fine.\n\n397. Robbery, or dacoity, with attempt to cause death or grievous hurt.—If, at the time of\ncommitting robbery or dacoity, the offender uses any deadly weapon, or causes grievous hurt to any\nperson, or attempts to cause death or grievous hurt to any person, the imprisonment with which such\noffender shall be punished shall not be less than seven years.\n\n398. Attempt to commit robbery or dacoity when armed with deadly weapon.—If, at the time of\nattempting to commit robbery or dacoity, the offender is armed with any deadly weapon, the\nimprisonment with which such offender shall be punished shall not be less than seven years.\n\n399. Making preparation to commit dacoity—Whoever makes any preparation for committing\ndacoity, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall\nalso be liable to fine.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n91\n\n\n400. Punishment for belonging to gang of dacoits —Whoever, at any time after the passing of this\nAct, shall belong to a gang of persons associated for the purpose of habitually committing dacoity, shall\nbe punished with '[imprisonment for life], or with rigorous imprisonment for a term which may extend to\nten years, and shall also be liable to fine.\n\n401. Punishment for belonging to gang of thieves —Whoever, at any time after the passing of this\nAct, shall belong to any wandering or other gang of persons associated for the purpose of habitually\ncommitting theft or robbery, and not being a gang of thugs or dacoits, shall be punished with rigorous\nimprisonment for a term which may extend to seven years, and shall also be liable to fine.\n\n402. Assembling for purpose of committing dacoity—Whoever, at any time after the passing of\nthis Act, shall be one of five or more persons assembled for the purpose of committing dacoity, shall be\npunished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable\nto fine.\n\nOf Criminal Misappropriation of Property\n\n403. Dishonest misappropriation of property—Whoever dishonestly misappropriates or converts\nto his own use any movable property, shall be punished with imprisonment of either description for a\nterm which may extend to two years, or with fine, or with both.\n\nIllustrations\n\n(a) A takes property belonging to Z out of Z's possession, in good faith believing at the time when he takes it, that the\nproperty belongs to himself. A is not guilty of theft; but if A, after discovering his mistake, dishonestly appropriates the property\nto his own use, he is guilty of an offence under this section.\n\n(b) A, being on friendly terms with Z, goes into Z's library in Z's absence, and takes away a book without Z's express\nconsent. Here, if A was under the impression that he had Z's implied consent to take the book for the purpose of reading it, A has\nnot committed theft. But, if A afterwards sells the book for his own benefit, he is guilty of an offence under this section.\n\n(c) A and B, being, joint owners of a horse, A takes the horse out of B's possession, intending to use it. Here, as A has a right\nto use the horse, he does not dishonestly misappropriate it. But, if A sells the horse and appropriates the whole proceeds to his\nown use, he is guilty of an offence under this section.\n\nExplanation I —A dishonest misappropriation for a time only is a misappropriation with the meaning\nof this section.\n\nIllustration\n\nA finds a Government promissory note belonging to Z, bearing a blank endorsement. A, knowing that the note belongs to Z,\npledges it with a banker as a security or a loan, intending at a future time to restore it to Z. A has committed an offence under this\nsection.\n\nExplanation 2.—A person who finds property not in the possession of any other person, and takes\nsuch property for the purpose of protecting it for, or of restoring it to, the owner, does not take or\nmisappropriate it dishonestly, and is not guilty of an offence; but he is guilty of the offence above defined,\nif he appropriates it to his own use, when he knows or has the means of discovering the owner, or before\nhe has used reasonable means to discover and give notice to the owner and has kept the property a\nreasonable time to enable the owner to claim it.\n\nWhat are reasonable means or what is a reasonable time in such a case, is a question of fact.\n\nIt is not necessary that the finder should know who is the owner of the property, or that any particular\nperson is the owner of it; it is sufficient if, at the time of appropriating it, he does not believe it to be his\nown property, or in good faith believe that the real owner cannot be found.\n\nIllustrations\n\n(a) A finds a rupee on the high road, not knowing to whom the rupee belongs, A picks up the rupee. Here A has not\ncommitted the offence defined in this section.\n\n(b) A finds a letter on the road, containing a bank note. From the direction and contents of the letter he learns to whom the\nnote belongs. He appropriates the note. He is guilty of an offence under this section.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n92\n\n\n(c) A finds a cheque payable to bearer. He can form no conjecture as to the person who has lost the cheque. But the name of\nthe person, who has drawn the cheque, appears. A knows that this person can direct him to the person in whose favour the cheque\nwas drawn. A appropriates the cheque without attempting to discover the owner. He is guilty of an offence under this section.\n\n(d) A sees Z drop his purse with money in it. A picks up the purse with the intention of restoring it to Z, but afterwards\nappropriates it to his own use. A has committed an offence under this section.\n\n(e) A finds a purse with money, not knowing to whom it belongs; he afterwards discovers that it belongs to Z, and\nappropriates it to his own use. A is guilty of an offence under this section.\n\n(f) A finds a valuable ring, not knowing to whom it belongs. A sells it immediately without attempting to discover the\nowner. A is guilty of an offence under this section.\n\n404. Dishonest misappropriation of property possessed by deceased person at the time of his\ndeath—Whoever dishonestly misappropriates or converts to his own use property, knowing that such\nproperty was in the possession of a deceased person at the time of that person's decease, and has not since\nbeen in the possession of any person legally entitled to such possession, shall be punished with\nimprisonment of either description for a term which may extend to three years, and shall also be liable to\nfine, and if the offender at the time of such person's decease was employed by him as a clerk or servant,\nthe imprisonment may extend to seven years.\n\nIllustration\n\nZ dies in possession of furniture and money. His servant A, before the money comes into the possession of any person\nentitled to such possession, dishonestly misappropriates it. A has committed the offence defined in this section.\n\nOf Criminal Breach of Trust\n\n405. Criminal breach of trust —Whoever, being in any manner entrusted with property, or with any\ndominion over property, dishonestly misappropriates or converts to his own use that property, or\ndishonestly uses or disposes of that property in violation of any direction of law prescribing the mode in\nwhich such trust is to be discharged, or of any legal contract, express or implied, which he has made\ntouching the discharge of such trust, or wilfully suffers any other person so to do, commits “criminal\nbreach of trust”.\n\n'? [Explanation I].—A person, being an employer *[of an establishment whether exempted under",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  },
  {
    "section": "17",
    "title": "of the Employees’ Provident Funds and Miscellaneous Provisions Act, 1952 (19 of 1952) or",
    "raw_text": "not] who deducts the employee’s contribution from the wages payable to the employee for credit to a\nProvident Fund or Family Pension Fund established by any law for the time being in force, shall be\ndeemed to have been entrusted with the amount of the contribution so deducted by him and if he makes\ndefault in the payment of such contribution to the said Fund in violation of the said law, shall be deemed\nto have dishonestly used the amount of the said contribution in violation of a direction of law as\naforesaid. |\n\n[Explanation 2.—A person, being an employer, who deducts the employees’ contribution from the\nwages payable to the employee for credit to the Employees’ State Insurance Fund held and administered\nby the Employees’ State Insurance Corporation established under the Employees’ State Insurance Act,\n1948 (34 of 1948), shall be deemed to have been entrusted with the amount of the contribution so\ndeducted by him and if he makes default in the payment of such contribution to the said Fund in violation\nof the said Act, shall be deemed to have dishonestly used the amount of the said contribution in violation\nof a direction of law as aforesaid. |\n\nIllustrations\n\n(a) A, being executor to the will of a deceased person, dishonestly disobeys the law which directs him to divide the effects\naccording to the will, and appropriates them to his own use. A has committed criminal breach of trust.\n\n(b) A is a warehouse-keeper. Z going on a journey, entrusts his furniture to A, under a contract that it shall be returned on\npayment of a stipulated sum for warehouse room. A dishonestly sells the goods. A has committed criminal breach of trust.\n\n1. Ins. by Act 40 of 1973, s. 9 (w.e.f. 1-11-1973).\n\n2. Explanation numbered as Explanation | by Act 38 of 1975, s. 9 (w.e.f. 1-9-1975).\n3. Ins. by Act 33 of 1988, s. 27 (w.e.f. 1-8-1988).\n\n4. Ins. by Act 38 of 1975, s. 9 (w.e.f. 1-9-1975).\n\n93\n\n\n(c) A, residing in Calcutta, is agent for Z, residing at Delhi. There is an express or implied contract between A and Z, that all\nsums remitted by Z to A shall be invested by A, according to Z's direction. Z remits a lakh of rupees to A, with directions to A to\ninvest the same in Company's paper. A dishonestly disobeys the directions and employs the money in his own business. A has\ncommitted criminal breach of trust.\n\n(d) But if A, in the last illustration, not dishonestly but in good faith, believing that it will be more for Z's advantage to hold\nshares in the Bank of Bengal, disobeys Z's directions, and buys shares in the Bank of Bengal, for Z, instead of buying Company's\npaper, here, thought Z should suffer loss, and should be entitled to bring a civil action against A, on account of that loss, yet A,\nnot having acted dishonestly, has not committed criminal breach of trust.\n\n(e) A, a revenue-officer, is entrusted with public money and is either directed by law, or bound by a contract, express or\nimplied, with the Government, to pay into a certain treasury all the public money which he holds. A dishonestly appropriates the\nmoney. A has committed criminal breach of trust.\n\n(f) A, a carrier, is entrusted by Z with property to be carried by land or by water. A dishonestly misappropriates the property.\nA has committed criminal breach of trust.\n\n406. Punishment for criminal breach of trust —Whoever commits criminal breach of trust shall be\npunished with imprisonment of either description for a term which may extend to three years, or with\nfine, or with both.\n\n407. Criminal breach of trust by carrier, ete —Whoever, being entrusted with property as a carrier,\nwharfinger or warehouse-keeper, commits criminal breach of trust in respect of such property, shall be\npunished with imprisonment of either description for a term which may extend to seven years, and shall\nalso be liable to fine.\n\n408. Criminal breach of trust by clerk or servant—Whoever, being a clerk or servant or employed\nas a clerk or servant, and being in any manner entrusted in such capacity with property, or with any\ndominion over property, commits criminal breach of trust in respect of that property, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n409. Criminal breach of trust by public servant, or by banker, merchant or agent—Whoever,\nbeing in any manner entrusted with property, or with any dominion over property in his capacity of a\npublic servant or in the way of his business as a banker, merchant, factor, broker, attorney or agent,\ncommits criminal breach of trust in respect of that property, shall be punished with '[imprisonment for\nlife], or with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\nOf the Receiving of Stolen Property\n\n410. Stolen property——Property, the possession whereof has been transferred by theft, or by\nextortion, or by robbery, and property which has been criminally misappropriated or in respect of which\n*x#* 3 criminal breach of trust has been committed, is designated as “stolen property”, “[whether the\ntransfer has been made, or the misappropriation or breach of trust has been committed, within or without\n*[India]]. But, if such property subsequently comes into the possession of a person legally entitled to the\npossession thereof, it then ceases to be stolen property.\n\n411. Dishonestly receiving stolen property—Whoever dishonestly receives or retains any stolen\nproperty, knowing or having reason to believe the same to be stolen property, shall be punished with\nimprisonment of either description for a term which may extend to three years, or with fine, or with both.\n\n412. Dishonestly receiving property stolen in the commission of a dacoity —Whoever dishonestly\nreceives or retains any stolen property, the possession whereof he knows or has reason to believe to have\nbeen transferred by the commission of dacoity, or dishonestly receives from a person, whom he knows or\nhas reason to believe to belong or to have belonged to a gang of dacoits, property which he knows or has\nreason to believe to have been stolen, shall be punished with [imprisonment for life], or with rigorous\nimprisonment for a term which may extend to ten years, and shall also be liable to fine.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n2. The word “the” rep by Act 12 of 1891, s. 2 and the First Sch.\n\n3. The words “offence of” rep by Act 8 of 1882, s. 9.\n\n4. Ins. by s. 9, ibid.\n\n5. The words “British India” have successively been subs. by the A. O. 1948, the A. O. 1950 and Act 3 of 1951, s. 3 and the Sch.,\nto read as above.\n\n94\n\n\n413. Habitually dealing in stolen property——Whoever habitually receives or deals in property\nwhich he knows or has reason to believe to be stolen property, shall be punished with '[imprisonment for\nlife], or with imprisonment of either description for a term which may extend to ten years, and shall also\nbe liable to fine.\n\n414. Assisting in concealment of stolen property—Whoever voluntarily assists in concealing or\ndisposing of or making away with property which he knows or has reason to believe to be stolen property,\nshall be punished with imprisonment of either description for a term which may extend to three years, or\nwith fine, or with both.\n\nOf Cheating\n\n415. Cheating —Whoever, by deceiving any person, fraudulently or dishonestly induces the person\nso deceived to deliver any property to any person, or to consent that any person shall retain any property,\nor intentionally induces the person so deceived to do or omit to do anything which he would not do or\nomit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to\nthat person in body, mind, reputation or property, is said to “cheat”.\n\nExplanation.—A dishonest concealment of facts is a deception within the meaning of this section.\n\nIllustrations\n\n(a) A, by falsely pretending to be in the Civil Service, intentionally deceives Z, and thus dishonestly induces Z to let him\nhave on credit goods for which he does not mean to pay. A cheats.\n\n(b) A, by putting a counterfeit mark on an article, intentionally deceives Z into a belief that this article was made by a certain\ncelebrated manufacturer, and thus dishonestly induces Z to buy and pay for the article. A cheats.\n\n(c) A, by exhibiting to Z a false sample of an article intentionally deceives Z into believing that the article corresponds with\nthe sample, and thereby dishonestly induces Z to buy and pay for the article. A cheats.\n\n(d) A, by tendering in payment for an article a bill on a house with which A keeps no money, and by which A expects that\nthe bill will be dishonoured, intentionally deceives Z, and thereby dishonestly induces Z to deliver the article, intending not to\npay for it. A cheats.\n\n(e) A, by pledging as diamond articles which he knows are not diamonds, intentionally deceives Z, and thereby dishonestly\ninduces Z to lend money. A cheats.\n\n(f) A Intentionally deceives Z into a belief that A means to repay any money that Z may lend to him and thereby dishonestly\ninduces Z to lend him money, A not intending to repay it. A cheats.\n\n(g) A intentionally deceives Z into a belief that A means to deliver to Z a certain quantity of indigo plant which he does not\nintend to deliver, and thereby dishonestly induces Z to advance money upon the faith of such delivery. A cheats; but if A, at the\ntime of obtaining the money, intends to deliver the indigo plant, and afterwards breaks his contract and does not deliver it, he\ndoes not cheat, but is liable only to a civil action for breach of contract.\n\n(A) A intentionally deceives Z into a belief that A has performed A's part of a contract made with Z, which he has not\nperformed, and thereby dishonestly induces Z to pay money. A cheats.\n\n(7) A sells and conveys an estate to B. A, knowing that in consequence of such sale he has no right to the property, sells or\nmortgages the same to Z, without disclosing the fact of the previous sale and conveyance to B, and receives the purchase or\nmortgage money from Z. A cheats.\n\n416. Cheating by personation.—A person is said to “cheat by personation” if he cheats by\npretending to be some other person, or by knowingly substituting one person for or another, or\nrepresenting that he or any other person is a person other than he or such other person really is.\n\nExplanation.—The offence is committed whether the individual personated is a real or imaginary\nperson.\n\nIllustrations\n(a) A cheats by pretending to be a certain rich banker of the same name. A cheats by personation.\n\n(b) A cheats by pretending to be B, a person who is deceased. A cheats by personation.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n95\n\n\n417. Punishment for cheating —Whoever cheats shall be punished with imprisonment of either\ndescription for a term which may extend to one year, or with fine, or with both.\n\n418. Cheating with knowledge that wrongful loss may ensue to person whose interest offender is\nbound to protect —Whoever cheats with the knowledge that he is likely thereby to cause wrongful loss\nto a person whose interest in the transaction to which the cheating relates, he was bound, either by law, or\nby a legal contract, to protect, shall be punished with imprisonment of either description for a term which\nmay extend to three years, or with fine, or with both.\n\n419. Punishment for cheating by personation Whoever cheats by personation shall be punished\nwith imprisonment of either description for a term which may extend to three years, or with fine, or with\nboth.\n\n420. Cheating and dishonestly inducing delivery of property—Whoever cheats and thereby\ndishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy\nthe whole or any part of a valuable security, or anything which is signed or sealed, and which is capable\nof being converted into a valuable security, shall be punished with imprisonment of either description for\na term which may extend to seven years, and shall also be liable to fine.\n\nOf Fraudulent Deeds and Dispositions of Property\n\n421. Dishonest or fraudulent removal or concealment of property to prevent distribution among\ncreditors —Whoever dishonestly or fraudulently removes, conceals or delivers to any person, or transfers\nor causes to be transferred to any person, without adequate consideration, any property, intending thereby\nto prevent, or knowing it to be likely that he will thereby prevent, the distribution of that property\naccording to law among his creditors or the creditors of any other person, shall be punished with\nimprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n422. Dishonestly or fraudulently preventing debt being available for creditors —Whoever\ndishonestly or fraudulently prevents any debt or demand due to himself or to any other person from being\nmade available according to law for payment of his debts or the debts of such other person, shall be\npunished with imprisonment of either description for a term which may extend to two years, or with fine,\nor with both.\n\n423. Dishonest or fraudulent execution of deed of transfer containing false statement of\nconsideration —Whoever dishonestly or fraudulently signs, executes or becomes a party to any deed or\ninstrument which purports to transfer or subject to any charge any property, or any interest therein, and\nwhich contains any false statement relating to the consideration for such transfer or charge, or relating to\nthe person or persons for whose use or benefit it is really intended to operate, shall be punished with\nimprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n424. Dishonest or fraudulent removal or concealment of property—Whoever dishonestly or\nfraudulently conceals or removes any property of himself or any other person, or dishonestly or\nfraudulently assists in the concealment or removal thereof, or dishonestly releases any demand or claim to\nwhich he is entitled, shall be punished with imprisonment of either description for a term which may\nextend to two years, or with fine, or with both.\n\nOf Mischief\n\n425. Mischief —Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or\ndamage to the public or to any person, causes the destruction of any property, or any such change in any\nproperty or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously,\ncommits “mischief”.\n\nExplanation 1 —It is not essential to the offence of mischief that the offender should intend to cause\nloss or damage to the owner of the property injured or destroyed. It is sufficient if he intends to cause, or\nknows that he is likely to cause, wrongful loss or damage to any person by injuring any property, whether\nit belongs to that person or not.\n\nExplanation 2——Mischief may be committed by an act affecting property belonging to the person\nwho commits the act, or to that person and others jointly.\n\n96\n\n\nIllustrations\n(a) A voluntarily burns a valuable security belonging to Z intending to cause wrongful loss to Z. A has committed mischief.\n\n(b) A introduces water in to an ice-house belonging to Z and thus causes the ice to melt, intending wrongful loss to Z. A has\ncommitted mischief.\n\n(c) A voluntarily throws into a river a ring belonging to Z, with the intention of thereby causing wrongful loss to Z. A has\ncommitted mischief.\n\n(d) A, knowing that his effects are about to be taken in execution in order to satisfy a debt due from him to Z, destroys those\neffects, with the intention of thereby preventing Z from obtaining satisfaction of the debt, and of thus causing damage to Z. A has\ncommitted mischief.\n\n(e) A having insured a ship, voluntarily causes the same to be cast away, with the intention of causing damage to the\nunderwriters. A has committed mischief.\n\n(f) A causes a ship to be cast away, intending thereby to cause damage to Z who has lent money on bottomry on the ship. A\nhas committed mischief.\n\n(g) A, having joint property with Z in a horse, shoots the horse, intending thereby to cause wrongful loss to Z. A has\ncommitted mischief.\n\n(A) A causes cattle to enter upon a field belonging to Z, intending to cause and knowing that he is likely to cause damage to\nZ's crop. A has committed mischief.\n\n426. Punishment for mischief —Whoever commits mischief shall be punished with imprisonment of\neither description for a term which may extend to three months, or with fine, or with both.\n\n427. Mischief causing damage to the amount of fifty rupees—Whoever commits mischief and\nthereby causes loss or damage to the amount of fifty rupees or upwards, shall be punished with\nimprisonment of either description for a term which may extend to two years, or with fine, or with both.\n\n428. Mischief by killing or maiming animal of the value of ten rupees—Whoever commits\nmischief by killing, poisoning, maiming or rendering useless any animal or animals of the value of the ten\nrupees or upwards, shall be punished with imprisonment of either description for a term which may\nextend to two years, or with fine, or with both.\n\n429. Mischief by killing or maiming cattle, etc., of any value or any animal of the value of fifty\nrupees.—Whoever commits mischief by killing, poisoning, maiming or rendering useless, any elephant,\ncamel, horse, mule, buffalo, bull, cow or ox, whatever may be the value thereof, or any other animal of\nthe value of fifty rupees or upwards, shall be punished with imprisonment of either description for a term\nwhich may extend to five years, or with fine, or with both.\n\n430. Mischief by injury to works of irrigation or by wrongfully diverting water —Whoever\ncommits mischief by doing any act which causes, or which he knows to be likely to cause, a diminution\nof the supply of water for agricultural purposes, or for food or drink for human beings or for animals\nwhich are property, or for cleanliness or for carrying on any manufacture, shall be punished with\nimprisonment of either description for a term which may extend to five years, or with fine, or with both.\n\n431. Mischief by injury to public road, bridge, river or channel Whoever commits mischief by\ndoing any act which renders or which he knows to be likely to render any public road, bridge, navigable\nriver or navigable channel, natural or artificial, impassable or less safe for travelling or conveying\nproperty, shall be punished with imprisonment of either description for a term which may extend to five\nyears, or with fine, or with both.\n\n432. Mischief by causing inundation or obstruction to public drainage attended with damage. —\nWhoever commits mischief by doing any act which causes or which he knows to be likely to cause an\ninundation or an obstruction to any public drainage attended with injury or damage, shall be punished\nwith imprisonment of either description for a term which may extend to five years, or with fine, or with\nboth.\n\n433. Mischief by destroying, moving or rendering less useful a light-house or sea-mark.—\nWhoever commits mischief by destroying or moving any light-house or other light used as a sea-mark, or\nany sea- mark or buoy or other thing placed as a guide for navigators, or by any act which renders any\nsuch light-house, sea-mark, buoy or other such thing as aforesaid less useful as a guide for navigators,\nshall be punished with imprisonment of either description for a term which may extend to seven years, or\nwith fine, or with both.\n\n97\n\n\n434. Mischief by destroying or moving, etc., a land-mark fixed by public authority —Whoever\ncommits mischief by destroying or moving any land-mark fixed by the authority of a public servant, or by\nany act which renders such land-mark less useful as such, shall be punished with imprisonment of either\ndescription for a term which may extend to one year, or with fine, or with both.\n\n435. Mischief by fire or explosive substance with intent to cause damage to amount of one\nhundred or (in case of agricultural produce) ten rupees—Whoever commits mischief by fire or any\nexplosive substance intending to cause, or knowing it to be likely that he will thereby cause, damage to\nany property to the amount of one hundred rupees or upwards '[or (where the property is agricultural\nproduce) ten rupees or upwards], shall be punished with imprisonment of either description for a term\nwhich may extend to seven years and shall also be liable to fine.\n\n436. Mischief by fire or explosive substance with intent to destroy house, ete —Whoever commits\nmischief by fire or any explosive substance, intending to cause, or knowing it to be likely that he will\nthereby cause, the destruction of any building which is ordinarily used as a place of worship or as a\nhuman dwelling or as a place for the custody of property, shall be punished with *[imprisonment for life],\nor with imprisonment of either description for a term which may extend to ten years, and shall also be\nliable to fine.\n\n437. Mischief with intent to destroy or make unsafe a decked vessel or one of twenty tons\nburden.—Whoever commits mischief to any decked vessel or any vessel of a burden of twenty tons or\nupwards, intending to destroy or render unsafe, or knowing it to be likely that he will thereby destroy or\nrender unsafe, that vessel, shall be punished with imprisonment of either description for a term which may\nextend to ten years, and shall also be liable to fine.\n\n438. Punishment for the mischief described in section 437 committed by fire or explosive\nsubstance. —Whoever commits, or attempts to commit, by fire or any explosive substance, such mischief\nas is described in the last preceding section, shall be punished with *[imprisonment for life]. or with\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\n439. Punishment for intentionally running vessel aground or ashore with intent to commit theft,\netc.—Whoever intentionally runs any vessel aground or ashore, intending to commit theft of any property\ncontained therein or to dishonestly misappropriate any such property, or with intent that such theft or\nmisappropriation of property may be committed, shall be punished with imprisonment of either\ndescription for a term which may extend to ten years, and shall also be liable to fine.\n\n440. Mischief committed after preparation made for causing death or hurt—Whoever commits\nmischief, having made preparation for causing to any person death, or hurt, or wrongful restraint, or fear\nof death, or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for\na term which may extend to five years, and shall also be liable to fine.\n\nOf Criminal Trespass\n\n441. Criminal trespass—Whoever enters into or upon property in the possession of another with\nintent to commit an offence or to intimidate, insult or annoy any person in possession of such property,\n\nor having lawfully entered into or upon such property, unlawfully remains there with intent thereby to\nintimidate, insult or annoy any such person, or with intent to commit an offence,\n\nis said to commit “criminal trespass”.\n\n442. House-trespass——Whoever commits criminal trespass by entering into or remaining in any\nbuilding, tent or vessel used as a human dwelling or any building used as a place for worship, or as a\nplace for the custody of property, is said to commit “house-trespass”’.\n\nExplanation.—The introduction of any part of the criminal trespasser's body is entering sufficient to\nconstitute house-trespass.\n\n1. Ins. by Act 8 of 1882, s. 10\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n98\n\n\n443. Lurking house-trespass—Whoever commits house-trespass having taken precautions to\nconceal such house-trespass from some person who has a right to exclude or eject the trespasser from the\nbuilding, tent or vessel which is the subject of the trespass, is said to commit “lurking house-trespass”’.\n\n444. Lurking house-trespass by night——Whoever commits lurking house-trespass after sunset and\nbefore sunrise, is said to commit “lurking house-trespass by night”.\n\n445. House-breaking.—A person is said to commit “house-breaking” who commits house-trespass if\nhe effects his entrance into the house or any part of it in any of the six ways hereinafter described; or if,\nbeing in the house or any part of it for the purpose of committing an offence, or having committed an\noffence therein, he quits the house or any part of it in any of such six ways, that is to say:—\n\nFirst—If he enters or quits through a passage made by himself, or by any abettor of the house-\ntrespass, in order to the committing of the house-trespass.\n\nSecondly.—If he enters or quits through any passage not intended by any person, other than himself\nor an abettor of the offence, for human entrance; or through any passage to which he has obtained access\nby scaling or climbing over any wall or building.\n\nThirdly.—If he enters or quits through any passage which he or any abettor of the house-trespass has\nopened, in order to the committing of the house-trespass by any means by which that passage was not\nintended by the occupier of the house to be opened.\n\nFourthly —If he enters or quits by opening any lock in order to the committing of the house-trespass,\nor in order to the quitting of the house after a house-trespass.\n\nFifthly —If he effects his entrance or departure by using criminal force or committing an assault, or\nby threatening any person with assault.\n\nSixthly.—If he enters or quits by any passage which he knows to have been fastened against such\nentrance or departure, and to have been unfastened by himself or by an abettor of the house-trespass.\n\nExplanation.—Any out-house or building occupied with a house, and between which and such house\nthere is an immediate internal communication, is part of the house within the meaning of this section.\n\nIllustrations\n\n(a) A commits house-trespass by making a hole through the wall of Z's house, and putting his hand through the aperture.\nThis is house- breaking.\n\n(b) A commits house-trespass by creeping into a ship at a port- hole between decks. This is house-breaking.\n(c) A commits house-trespass by entering Z's house through a window. This is house-breaking.\n\n(d) A commits house-trespass by entering Z's house through the door, having opened a door which was fastened. This is\nhouse-breaking.\n\n(e) A commits house-trespass by entering Z's house through the door, having lifted a latch by putting a wire through a hole\nin the door. This is house-breaking.\n\n(f) A finds the key of Z's house door, which Z had lost, and commits house-trespass by entering Z's house, having opened\nthe door with that key. This is house-breaking.\n\n(g) Z is standing in his doorway. A forces a passage by knocking Z down, and commits house-trespass by entering the\nhouse. This is house-breaking.\n\n(h) Z, the door-keeper of Y, is standing in Y's doorway. A commits house-trespass by entering the house, having deterred Z\nfrom opposing him by threatening to beat him. This is house-breaking.\n\n446. House-breaking by night—Whoever commits house-breaking after sunset and before sunrise,\nis said to commit “house-breaking by night”.\n\n447. Punishment for criminal trespass ——Whoever commits criminal trespass shall be punished\nwith imprisonment of either description for a term which may extend to three months, or with fine which\nmay extend to five hundred rupees, or with both.\n\n448. Punishment for house-trespass—Whoever commits house-trespass shall be punished with\nimprisonment of either description for a term which may extend to one year, or with fine which may\nextend to one thousand rupees, or with both.\n\n99\n\n\n449. House-trespass in order to commit offence punishable with death—Whoever commits\nhouse-trespass in order to the committing of any offence punishable with death, shall be punished with\n'[imprisonment for life], or with rigorous imprisonment for a term not exceeding ten years, and shall also\nbe liable to fine.\n\n450. House-trespass in order to commit offence punishable with imprisonment for life —\nWhoever commits house-trespass in order to the committing of any offence punishable with\n'[imprisonment for life], shall be punished with imprisonment of either description for a term not\nexceeding ten years, and shall also be liable to fine.\n\n451. House-trespass in order to commit offence punishable with imprisonment —Whoever\ncommits house-trespass in order to the committing of any offence punishable with imprisonment, shall be\npunished with imprisonment of either description for a term which may extend to two years, and shall\nalso be liable to fine; and if the offence intended to be committed is theft, the term of the imprisonment\nmay be extended to seven years.\n\n452. House-trespass alter preparation for hurt, assault or wrongful restraint —Whoever\ncommits house-trespass, having made preparation for causing hurt to any person or for assaulting any\nperson, or for wrongfully restraining any person, or for putting and person in fear of hurt, or of assault, or\nof wrongful restraint, shall be punished with imprisonment of either description for a term which may\nextend to seven years, and shall also be liable to fine.\n\n453. Punishment for lurking house-trespass or house-breaking—Whoever commits lurking\nhouse-trespass or house-breaking, shall be punished with imprisonment of either description for a term\nwhich may extend to two years, and shall also be liable to fine.\n\n454. Lurking house-trespass or house-breaking in order to commit offence punishable with\nimprisonment.—Whoever commits lurking house-trespass or house-breaking, in order to the committing\nof any offence punishable with imprisonment, shall be punished with imprisonment of either description\nfor a term which may extend to three years, and shall also be liable to fine; and if the offence intended to\nbe committed is theft, the term of the imprisonment may be extended to ten years.\n\n455. Lurking house-trespass or house-breaking after preparation for hurt, assault or wrongful\nrestraint—Whoever commits lurking house-trespass, or house-breaking, having made preparation for\ncausing hurt to any person, or for assaulting any person, or for wrongfully restraining any person, or for\nputting any person in fear of hurt or of assault or of wrongful restraint, shall be punished with\nimprisonment of either description or a term which may extend to ten years, and shall also be liable to\nfine.\n\n456. Punishment for lurking house-trespass or house-breaking by night—Whoever commits\nlurking house-trespass by night, or house-breaking by night, shall be punished with imprisonment of\neither description for a term which may extend to three years, and shall also be liable to fine.\n\n457. Lurking house-trespass or house-breaking by night in order to commit offence punishable\nwith imprisonment.—Whoever commits lurking house-trespass by night, or house-breaking by night, in\norder to the committing of any offence punishable with imprisonment, shall be punished with\nimprisonment of either description for a term which may extend to five years, and shall also be liable to\nfine; and, if the offence intended to be committed is theft, the term of the imprisonment may be extended\nto fourteen years.\n\n458. Lurking house-trespass or house-breaking by night after preparation for hurt, assault, or\nwrongful restraint—Whoever commits lurking house-trespass by night, or house-breaking by night,\nhaving made preparation for causing hurt to any person or for assaulting any person, or for wrongfully\nrestraining any person, or for putting any person in fear of hurt, or of assault, or of wrongful restraint,\nshall be punished with imprisonment of either description for a term which may extend to fourteen years,\nand shall also be liable to fine.\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n100\n\n\n459. Grievous hurt caused whilst committing lurking house-trespass or house-breaking —\nWhoever, whilst committing lurking house-trespass or house-breaking, causes grievous hurt to any person\nor attempts to cause death or grievous hurt to any person, shall be punished with '[imprisonment for life],\nor imprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\n460. All persons jointly concerned in lurking house-trespass or house-breaking by night\npunishable where death or grievous hurt caused by one of them.—If, at the time of the committing of\nlurking house-trespass by night or house-breaking by night, any person guilty of such offence shall\nvoluntarily cause or attempt to cause death or grievous hurt to any person, every person jointly concerned\nin committing such lurkking house-trespass by night or house-breaking by night, shall be punished with\n'[imprisonment for life], or with imprisonment of either description for a term which may extend to ten\nyears, and shall also be liable to fine.\n\n461. Dishonestly breaking open receptacle containing property—Whoever dishonestly or with\nintent to commit mischief, breaks open or unfastens any closed receptacle which contains or which he\nbelieves to contain property, shall be punished with imprisonment of either description for a term which\nmay extend to two years, or with fine, or with both.\n\n462. Punishment for same offence when committed by person entrusted with custody —\nWhoever, being entrusted with any closed receptacle which contains or which he believes to contain\nproperty, without having authority to open the same, dishonestly, or with intent to commit mischief,\nbreaks open or unfastens that receptacle, shall be punished with imprisonment of either description for a\nterm which may extend to three years, or with fine, or with both.\n\nCHAPTER XVIII\nOF OFFENCES RELATING TO DOCUMENTSAND TO?*** PROPERTY MARKS\n\n463. Forgery — [Whoever makes any false document or false electronic record or part of a\ndocument or electronic record, with intent to cause damage or injury], to the public or to any person, or to\nsupport any claim or title, or to cause any person to part with property, or to enter into any express or\nimplied contract, or with intent to commit fraud or that fraud may be committed, commits forgery.\n\n464. Making a false document.—’[A person is said to make a false document or false electronic\nrecord—\n\nFirst——Who dishonestly or fraudulently—\n(a) makes, signs, seals or executes a document or part of a document;\n(6) makes or transmits any electronic record or part of any electronic record;\n(c) affixes any “[electronic signature] on any electronic record;\n\n(d) makes any mark denoting the execution of a document or the authenticity of the\n“Telectronic signature],\n\nwith the intention of causing it to be believed that such document or part of document, electronic\nrecord or “[electronic signature] was made, signed, sealed, executed, transmitted or affixed by or by the\nauthority of a person by whom or by whose authority he knows that it was not made, singed, sealed,\nexecuted or affixed; or\n\nSecondly.—Who without lawful authority, dishonestly or fraudulently, by cancellation or otherwise,\nalters a document or an electronic record in any material part thereof, after it has been made, executed or\naffixed with “[electronic signature] either by himself or by any other person, whether such person be\nliving or dead at the time of such alteration; or\n\nThirdly—Who dishonestly or fraudulently causes any person to sign, seal, execute or alter a\ndocument or an electronic record or to affix his “[electronic signature] on any electronic record knowing\nthat such person by reason of unsoundness of mind or intoxication cannot, or that by reason of deception\n\n1. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n2. The words “TRADE OR” omitted by Act 43 of 1958, s. 135 and Sch. (w.e.f. 25-11-1959).\n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000).\n\n4. Subs. by Act 10 of 2009, s. 51, for “digital signature” (w.e.f. 27-10-2009).\n\n101\n\n\npractised upon him, he does not know the contents of the document or electronic record or the nature of\nthe alteration. ]\n\nIllustrations\n\n(a) A has a letter of credit upon B for rupees 10,000, written by Z. A, in order to defraud B, adds cipher to the 10,000, and\nmakes the sum 1,00,000 intending that it may be believed by B that Z so wrote the letter. A has committed forgery.\n\n(b) A, without Z's authority, affixes Z's seal to a document purporting to be a conveyance of an estate from Z to A, with the\nintention of selling the estate to B and thereby of obtaining from B the purchase-money. A has committed forgery.\n\n(c) A picks up a cheque on a banker signed by B, payable to bearer, but without any sum having been inserted in the cheque.\nA fraudulently fills up the cheque by inserting the sum of ten thousand rupees. A commits forgery.\n\n(d) A leaves with B, his agent, a cheque on a banker, signed by A, without inserting the sum payable and authorizes B to fill\nup the cheque by inserting a sum not exceeding ten thousand rupees for the purpose of making certain payments. B fraudulently\nfills up the cheque by inserting the sum of twenty thousand rupees. B commits forgery.\n\n(e) A draws a bill of exchange on himself in the name of B without B's authority, intending to discount it as a genuine bill\nwith a banker and intending to take up the bill on its maturity. Here, as A draws the bill with intent to deceive the banker by\nleading him to suppose that he had the security of B, and thereby to discount the bill, A is guilty of forgery.\n\n(f) Z's will contains these words——‘T direct that all my remaining property be equally divided between A, B and C.” A\ndishonestly scratches out B's name, intending that it may be believed that the whole was left to himself and C. A has committed\nforgery.\n\n(g) A endorses a Government promissory note and makes it payable to Z or his order by writing on the bill the words “Pay\nto Z or his order” and signing the endorsement. B dishonestly erases the words “Pay to Z or his order”, and thereby converts the\nspecial endorsement into a blank endorsement. B commits forgery.\n\n(A) A sells and conveys an estate to Z. A afterwards, in order to defraud Z of his estate, executes a conveyance of the same\nestate to B, dated six months earlier than the date of the conveyance to Z, intending it to be believed that he had conveyed the\nestate to B before he conveyed it to Z. A has committed forgery.\n\n(7) Z dictates his will to A. A intentionally writes down a different legatee named by Z, and by representing to Z that he has\nprepared the will according to his instructions, induces Z to sign the will. A has committed forgery.\n\n(7) A writes a letter and signs it with B's name without B's authority, certifying that A is a man of good character and in\ndistressed circumstances from unforeseen misfortune, intending by means of such letter to obtain alms from Z and other persons.\nHere, as A made a false document in order to induce Z to part with property, A has committed forgery.\n\n(k) A without B's authority writes a letter and signs it in B's name certifying to A's character, intending thereby to obtain\nemployment under Z. A has committed forgery inasmuch as he intended to deceive Z by the forged certificate, and thereby to\ninduce Z to enter into an express or implied contract for service.\n\nExplanation I —A man’s signature of his own name may amount to forgery.\n\nIllustrations\n\n(a) A signs his own name to a bill of exchange, intending that it may be believed that the bill was drawn by another person\nof the same name. A has committed forgery.\n\n(b) A writes the word “accepted” on a piece of paper and signs it with Z's name, in order that B may afterwards write on the\npaper a bill of exchange drawn by B upon Z, and negotiate the bill as though it had been accepted by Z. A is guilty of forgery;\nand if B, knowing the fact, draws the bill upon the paper pursuant to A's intention, B is also guilty of forgery.\n\n(c) A picks up a bill of exchange payable to the order of a different person of the same name. A endorses the bill in his own\nname, intending to cause it to be believed that it was endorsed by the person to whose order it was payable; here A has committed\n\nforgery.\n(d) A purchases an estate sold under execution of a decree against B. B, after the seizure of the estate, in collusion with Z,\nexecutes a lease of the estate, to Z at a nominal rent and for a long period and dates the lease six months prior to the seizure, with\n\nintent to defraud A, and to cause it to be believed that the lease was granted before the seizure. B, though he executes the lease in\nhis own name, commits forgery by antedating it.\n\n(e) A, a trader, in anticipation of insolvency, lodges effects with B for A's benefit, and with intent to defraud his creditors;\nand in order to give a colour to the transaction, writes a promissory note binding himself to pay to B a sum for value received,\nand antedates the note, intending that it may be believed to have been made before A was on the point of insolvency. A has\ncommitted forgery under the first head of the definition.\n\nExplanation 2.—The making of a false document in the name of a fictious person, intending it to be\nbelieved that the document was made by a real person, or in the name of a deceased person, intending it to\nbe believed that the document was made by the person in his lifetime, may amount to forgery.\n\n102\n\n\nIllustration\n\nA draws a bill of exchange upon a fictious person, and fraudulently accepts the bill in the name of such fictitious person with\nintent to negotiate it. A commits forgery.\n\n'[Explanation 3.—For the purposes of this section, the expression “affixing “[electronic signature]”\nshall have the meaning assigned to it in clause (d) of sub-section (/) of section 2 of the Information\nTechnology Act, 2000 (21 of 2000).]\n\n465. Punishment for forgery —Whoever commits forgery shall be punished with imprisonment of\neither description for a term which may extend to two years, or with fine, or with both.\n\n466. Forgery of record of Court or of public register, ete —*[Whoever forges a document or an\nelectronic record], purporting to be a record or proceeding of or in a Court of Justice, or a register of birth,\nbaptism, marriage or burial, or a register kept by a public servant as such, or a certificate or document\npurporting to be made by a public servant in his official capacity, or an authority to institute or defend a\nsuit, or to take any proceedings therein, or to confess judgment, or a power of attorney, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n'[Explanation—For the purposes of this section, \"register\" includes any list, data or record of any\nentries maintained in the electronic form as defined in clause (r) of sub-section (/) of section 2 of the\nInformation Technology Act, 2000 (21 of 2000).]\n\n467. Forgery of valuable security, will, ete —Whoever forges a document which purports to be a\nvaluable security or a will, or an authority to adopt a son, or which purports to give authority to any\nperson to make or transfer any valuable security, or to receive the principal, interest or dividends thereon,\nor to receive or deliver any money, movable property, or valuable security, or any document purporting to\nbe an acquittance or receipt acknowledging the payment of money, or an acquittance or receipt for the\ndelivery of any movable property or valuable security, shall be punished with “[imprisonment for life], or\nwith imprisonment of either description for a term which may extend to ten years, and shall also be liable\nto fine.\n\n468. Forgery for purpose of cheating —Whoever commits forgery, intending that the *[document or\nelectronic record forged] shall be used for the purpose of cheating, shall be punished with imprisonment\nof either description for a term which may extend to seven years, and shall also be liable to fine.\n\n469. Forgery for purpose of harming reputation —Whoever commits forgery, *[intending that the\ndocument or electronic record forged] shall harm the reputation of any party, or knowing that it is likely\nto be used for that purpose, shall be punished with imprisonment of either description for a term which\nmay extend to three years, and shall also be liable to fine.\n\n470. Forged document.—A false *[document or electronic record] made wholly or in part by forgery\nis designated “a forged *[document or electronic record]”.\n\n471. Using as genuine a forged document or electronic record—Whoever fraudulently or\ndishonestly uses as genuine any *[document or electronic record] which he knows or has reason to believe\nto be a forged *[document or electronic record], shall be punished in the same manner as if he had forged\nsuch *[document or electronic record].\n\n472. Making or possessing counterfeit seal, etc., with intent to commit forgery punishable under",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  },
  {
    "section": "467",
    "title": "—Whoever makes or counterfeits any seal, plate or other instrument for making an",
    "raw_text": "impression, intending that the same shall be used for the purpose of committing any forgery which would\nbe punishable under section 467 of this Code, or, with such intent, has in his possession any such seal,\nplate or other instrument, knowing the same to be counterfeit, shall be punished with “[imprisonment for\nlife], or with imprisonment of either description for a term which may extend to seven years, and shall\nalso be liable to fine.\n\n1. Ins. by Act 21 of 2000, s. 91 and the First Sch. (w.e.f. 17-10-2000).\n\n2. Subs. by Act 10 of 2009, s. 51, for “digital signature” (w.e.f. 27-10-2009).\n\n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000).\n\n4. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n5. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “document” (w.e.f. 17-10-2000).\n\n103\n\n\n473. Making or possessing counterfeit seal, etc., with intent to commit forgery punishable\notherwise.— Whoever makes or counterfeits any seal, plate or other instrument for making an impression,\nintending that the same shall be used for the purpose of committing any forgery which would be\npunishable under any section of this Chapter other than section 467, or, with such intent, has in his\npossession any such seal, plate or other instrument, knowing the same to be counterfeit, shall be punished\nwith imprisonment of either description for a term which may extend to seven years, and shall also be\nliable to fine.\n\n474. Having possession of document described in section 466 or 467, knowing it to be forged and\nintending to use it genuine—'[Whoever has in his possession any document or electronic record,\nknowing the same to be forged and intending that the same shall fraudulently or dishonestly be used as\ngenuine, shall, if the document or electronic record is one of the description mentioned in section 466 of\nthis Code], be punished with imprisonment of either description for a term which may extend to seven\nyears, and shall also be liable to fine; and if the document is one of the description mentioned in section\n467, shall be punished with *[imprisonment for life], or with imprisonment of either description, for a\nterm which may extend to seven years, and shall also be liable to fine.\n\n475. Counterfeiting device or mark used for authenticating documents described in section 467,\nor possessing counterfeit marked material—Whoever counterfeits upon, or in the substance of, any\nmaterial, any device or mark used for the purpose of authenticating any document described in section\n467 of this Code, intending that such device or mark shall be used for the purpose of giving the\nappearance of authenticity to any document then forged or thereafter to be forged on such material, or\nwho, with such intent, has in his possession any material upon or in the substance of which any such\ndevice or mark has been counterfeited, shall be punished with “[imprisonment for life], or with\nimprisonment of either description for a term which may extend to seven years, and shall also be liable to\nfine.\n\n476. Counterfeiting device or mark used for authenticating documents other than those\ndescribed in section 467, or possessing counterfeit marked material —Whoever counterfeits upon, or\nin the substance of, any material, any device or mark used for the purpose of authenticating *[any\ndocument or electronic record] other than the documents described in section 467 of this Code, intending\nthat such device or mark shall be used for the purpose of giving the appearance of authenticity to any\ndocument then forged or thereafter to be forged on such material, or who with such intent, has in his\npossession any material upon or in the substance of which any such device or mark has been\ncounterfeited, shall be punished with imprisonment of either description for a term which may extend to\nseven years, and shall also be liable to fine.\n\n477. Fraudulent cancellation, destruction, etc., of will, authority to adopt, or valuable\nsecurity —Whoever fraudulently or dishonestly, or with intent to cause damage or injury to the public or\nto any person, cancels, destroys or defaces, or attempts to cancel, destroy or deface, or secretes or\nattempts to secrete any document which is or purports to be a will, or an authority to adopt a son, or any\nvaluable security, or commits mischief in respect of such document, shall be punished with\n*[imprisonment for life], or with imprisonment of either description for a term which may extend to seven\nyears, and shall also be liable to fine.\n\n‘[477A. Falsification of accounts.—Whoever, being a clerk, officer or servant, or employed or\nacting in the capacity of a clerk, officer or servant, wilfully, and with intent to defraud, destroys, alters,\nmutilates or falsifies any *[book, electronic record, paper, writing] valuable security or account which\nbelongs to or is in the possession of his employer, or has been received by him for or on behalf of his\nemployer, or wilfully, and with intent to defraud, makes or abets the making of any false entry in, or\nomits or alters or abets the omission or alteration of any material particular from or in. any such *[book,\nelectronic record, paper, writing] valuable security or account, shall be punished with imprisonment of\neither description for a term which may extend to seven years, or with fine, or with both.\n\n1. Subs. by Act 21 of 2000, s. 91 and the First Sch., for certain words (w.e.f. 17-10-2000).\n\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n\n3. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “any document” (w.e.f. 17-10-2000).\n\n4. Added by Act 3 of 1895, s. 4.\n\n5. Subs. by Act 21 of 2000, s. 91 and the First Sch., for “book, paper, writing” (w.e.f. 17-10-2000).\n\n104\n\n\nExplanation.—It shall be sufficient in any charge under this section to allege a general intent to\ndefraud without naming any particular person intended to be defrauded or specifying any particular sum\nof money intended to be the subject of the fraud, or any particular day on which the offence was\ncommitted. ]\n\n'tOf?***Property and Other Marks\n\n478. [Trade Mark.| Rep. by the Trade and Merchandise Marks Act, 1958 (43 of 1958), s. 135 and\nSch. (w. e. f- 25-11-1959).\n\n479. Property mark—A mark used for denoting that movable property belongs to a particular\nperson is called a property mark.\n\n480. [Using a false trade mark.]| Rep. by the Trade and Merchandise Marks Act, 1958 (43 of 1958), s.\n135and Sch. (w.e.f. 25- 11-1959).\n\n481. Using a false property mark.—Whoever marks any movable property or goods or any case,\npackage or other receptacle containing movable property or goods, or uses any case, package or other\nreceptacle having any mark thereon, in a manner reasonably calculated to cause it to be believed that the\nproperty or goods so marked, or any property or goods contained in any such receptacle so marked,\nbelong to a person to whom they do not belong, is said to use a false property mark.\n\n482. Punishment for using a false property mark—Whoever uses ****any false property mark\nshall, unless he proves that he acted without intent to defraud, be punished with imprisonment of either\ndescription for a term which may extend to one year, or with fine, or with both.\n\n483. Counterfeiting a property mark used by another —Whoever counterfeits any “***property\nmark used by any other person shall be punished with imprisonment of either description for a term which\nmay extend to two years, or with fine, or with both.\n\n484. Counterfeiting a mark used by a public servant—Whoever counterfeits any property mark\nused by a public servant, or any mark used by a public servant to denote that any property has been\nmanufactured by a particular person or at a particular time or place, or that the property is of a particular\nquality or has passed through a particular office, or that it is entitled to any exemption, or uses as genuine\nany such mark knowing the same to be counterfeit, shall be punished with imprisonment of either\ndescription for a term which may extend to three years, and shall also be liable to fine.\n\n*[485. Making or possession of any instrument for counterfeiting a property mark.—Whoever\nmakes or has in his possession any die, plate or other instrument for the purpose of counterfeiting a\nproperty mark, or has in his possession a property mark for the purpose of denoting that any goods belong\nto a person to whom they do not belong, shall be punished with imprisonment of either description for a\nterm which may extend to three years, or with fine, or with both.]\n\n486. Selling goods marked with a counterfeit property mark.—*[Whoever sells, or exposes, or has\nhas in possession for sale, any goods or things with a counterfeit property mark] affixed to or impressed\nupon the same or to or upon any case, package or other receptacle in which such goods are contained,\nshall, unless he proves\n\n(a) that, having taken all reasonable precautions against committing an offence against this section, he\nhad at the time of the commission of the alleged offence no reason to suspect the genuineness of the mark,\nand\n\n(b) that, on demand made by or on behalf of the prosecutor, he gave all the information in his power\nwith respect to the persons from whom he obtained such goods or things, or\n\n(c) that otherwise he had acted innocently,\n\n1. Subs. by Act 4 of 1889, s. 3, for the original heading and ss. 478 to 489.\n\n2. The word “Trade” omitted by Act 43 of 1958, s. 135 and the Sch. (w.e.f. 25-11-1959).\n\n3. The words “any false trade mark or” omitted by s. 135 and the Sch., ibid. (w.e.f. 25-11-1959).\n4. The words “trade mark or” omitted by s. 135 and the Sch., ibid. (w.e.f. 25-11-1959).\n\n5. Subs. by s. 135 and the Sch., ibid., for s. 485 (w.e.f. 25-11-1959).\n\n6. Subs. by s. 135 and the Sch., ibid., for certain words (w.e.f. 25-11-1959).\n\n105\n\n\nbe punished with imprisonment of either description for a term which may extend to one year, or with\nfine, or with both.\n\n487. Making a false mark upon any receptacle containing goods—Whoever makes any false\nmark upon any case, package or other receptacle containing goods, in a manner reasonably calculated to\ncause any public servant or any other person to believe that such receptacle contains goods which it does\nnot contain or that it does not contain goods which it does contain, or that the goods contained in such\nreceptacle are of a nature or quality different from the real nature or quality thereof, shall, unless he\nproves that he acted without intent to defraud, be punished with imprisonment of either description for a\nterm which may extend to three years, or with fine, or with both.\n\n488. Punishment for making use of any such false mark —Whoever makes use of any such false\nmark in any manner prohibited by the last foregoing section shall, unless he proves that he acted without\nintent to defraud, be punished as if he had committed an offence against that section.\n\n489. Tampering with property mark with intent to cause injury—Whoever removes, destroys,\ndefaces or adds to any property mark, intending or knowing it to be likely that he may thereby cause\ninjury to any person, shall be punished with imprisonment of either description for a term which may\nextend to one year, or with fine, or with both.]\n\n'LOf Currency-Notes and Bank-Notes\n\n489A. Counterfeiting currency-notes or bank-notes—Whoever counterfeits, or knowingly\nperforms any part of the process of counterfeiting, any currency-note or bank-note, shall be punished with\n*[imprisonment for life], or with imprisonment of either description for a term which may extend to ten\nyears, and shall also be liable to fine.\n\nExplanation.—For the purposes of this section and of sections 489B, *[489C, 489D and 489E], the\nexpression “bank-note” means a promissory note or engagement for the payment of money to bearer on\ndemand issued by any person carrying on the business of banking in any part of the world, or issued by or\nunder the authority of any State or Sovereign Power, and intended to be used as equivalent to, or as a\nsubstitute for money.\n\n489B. Using as genuine, forged or counterfeit currency-notes or bank-notes—Whoever sells to,\nor buys or receives from, any other person, or otherwise traffics in or uses as genuine, any forged or\ncounterfeit currency-note or bank-note, knowing or having reason to believe the same to be forged or\ncounterfeit, shall be punished with *[imprisonment for life], or with imprisonment of either description for\na term which may extend to ten years, and shall also be liable to fine.\n\n489C. Possession of forged or counterfeit currency-notes or bank-notes—Whoever has in his\npossession any forged or counterfeit currency-note or bank-note, knowing or having reason to believe the\nsame to be forged or counterfeit and intending to use the same as genuine or that it may be used as\ngenuine, shall be punished with imprisonment of either description for a term which may extend to seven\nyears, or with fine, or with both.\n\n489D. Making or possessing instruments or materials for forging or counterfeiting currency\nnotes or bank-notes—Whoever makes, or performs any part of the process of making, or buys or sells\nor disposes of, or has in his possession, any machinery, instrument or material for the purpose of being\nused, or knowing or having reason to believe that it is intended to be used, for forging or counterfeiting\nany currency-note or bank-note, shall be punished with *[imprisonment for life], or with imprisonment of\neither description for a term which may extend to ten years, and shall also be liable to fine. ]\n\n‘[489E. Making or using documents resembling currency-notes or bank-notes—(/) Whoever\nmakes, or causes to be made, or uses for any purpose whatsoever, or delivers to any person, any document\npurporting to be, or in any way resembling, or so nearly resembling as to be calculated to deceive, any\ncurrency-note or bank-note shall be punished with fine which may extend to one hundred rupees.\n\n1. Added by Act 12 of 1899, s. 2.\n\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation for life” (w.e.f. 1-1-1956).\n3. Subs. by Act 35 of 1950, s. 3 and the Second Sch., for “489C and 489D”.\n\n4. Ins. by Act 6 of 1943, s. 2.\n\n106\n\n\n(2) If any person, whose name appears on a document the making of which is an offence under\nsub-section (/), refuses, without lawful excuse, to disclose to a police-officer on being so required the\nname and address of the person by whom it was printed or otherwise made, he shall be punished with fine\nwhich may extend to two hundred rupees.\n\n(3) Where the name of any person appears on any document in respect of which any person is\ncharged with an offence under sub- section (/) or on any other document used or distributed in connection\nwith that document it may, until the contrary is proved, be presumed that that person caused the document\nto be made. ]\n\nCHAPTER XIX\nOFTHE CRIMINAL BREACHOF CONTRACTSOF SERVICE\n\n490. [Breach of contract of service during voyage or journey.| Rep. by the Workmen's Breach of\nContract (Repealing) Act, 1925 (3 of 1925), s. 2 and Sch.\n\n491. Breach of contract to attend on and supply wants of helpless person.—Whoever, being\nbound by a lawful contract to attend on or to supply the wants of any person who, by reason of youth, or\nof unsoundness of mind, or of a disease or bodily weakness, is helpless or incapable of providing for his\nown safety or of supplying his own wants, voluntarily omits so to do, shall be punished with\nimprisonment of either description for a term which may extend to three months, or with fine which may\nextend to two hundred rupees, or with both.\n\n492. [Breach of contract to serve at distant place to which servant is conveyed at master's expense.]|\nRep. by the Workmen's Breach of Contract (Repealing) Act,1925 (3 of 1925), s. 2 and Sch.\n\nCHAPTER XX\nOFOFFENCES RELATINGTO MARRIAGE\n\n493. Cohabitation caused by a man deceitfully inducing a belief of lawful marriage —Every man\nwho by deceit causes any woman who is not lawfully married to him to believe that she is lawfully\nmarried to him and to cohabit or have sexual intercourse with him in that belief, shall be punished with\nimprisonment of either description for a term which may extend to ten years, and shall also be liable to\nfine.\n\n494. Marrying again during lifetime of husband or wife Whoever, having a husband or wife\nliving, marries in any case in which such marriage is void by reason of its taking place during the life of\nsuch husband or wife, shall be punished with imprisonment of either description for a term which may\nextend to seven years, and shall also be liable to fine.\n\nException.—This section does not extend to any person whose marriage with such husband or wife\nhas been declared void by a Court of competent jurisdiction,\n\nnor to any person who contracts a marriage during the life of a former husband or wife, if such\nhusband or wife, at the time of the subsequent marriage, shall have been continually absent from such\nperson for the space of seven years, and shall not have been heard of by such person as being alive within\nthat time provided the person contracting such subsequent marriage shall, before such marriage takes\nplace, inform the person with whom such marriage is contracted of the real state of facts so far as the\nsame are within his or her knowledge.\n\n495. Same offence with concealment of former marriage from person with whom subsequent\nmarriage is contracted.—Whoever commits the offence defined in the last preceding section having\nconcealed from the person with whom the subsequent marriage is contracted, the fact of the former\nmarriage, shall be punished with imprisonment of either description for a term which may extend to ten\nyears, and shall also be liable to fine.\n\n496. Marriage ceremony fraudulently gone through without lawful marriage—Whoever,\ndishonestly or with a fraudulent intention, goes through the ceremony of being married, knowing that he\nis not thereby lawfully married, shall be punished with imprisonment of either description for a term\nwhich may extend to seven years, and shall also be liable to fine.\n\n107\n\n\n497. Adultery —Whoever has sexual intercourse with a person who is and whom he knows or has\nreason to believe to be the wife of another man, without the consent or connivance of that man, such\nsexual intercourse not amounting to the offence of rape, is guilty of the offence of adultery, and shall be\npunished with imprisonment of either description for a term which may extend to five years, or with fine,\nor with both. In such case the wife shall not be punishable as an abettor.\n\n498. Enticing or taking away or detaining with criminal intent a married woman.—Whoever\ntakes or entices away any woman who is and whom he knows or has reason to believe to be the wife of\nany other man, from that man, or from any person having the care of her on behalf of that man, with\nintent that she may have illicit intercourse with any person, or conceals or detains with that intent any\nsuch woman, shall be punished with imprisonment of either description for a term which may extend to\ntwo years, or with fine, or with both.\n\n'TCHAPTER XXA\nOF CRUELTY BY HUSBANDOR RELATIVESOF HUSBAND\n\n498A. Husband or relative of husband of a woman subjecting her to cruelty—Whoever, being\nthe husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished\nwith imprisonment for a term which may extend to three years and shall also be liable to fine.\n\nExplanation.—For the purposes of this section, “cruelty” means—\n\n(a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide\nor to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman;\nor\n\n(6) harassment of the woman where such harassment is with a view to coercing her or any person\nrelated to her to meet any unlawful demand for any property or valuable security or is on account of\nfailure by her or any person related to her to meet such demand. ]\n\nCHAPTER XxI\nOF DEFAMATION\n\n499. Defamation.—Whoever, by words either spoken or intended to be read, or by signs or by visible\nrepresentations, makes or publishes any imputation concerning any person intending to harm, or knowing\nor having reason to believe that such imputation will harm, the reputation of such person, is said, except\nin the cases hereinafter excepted, to defame that person.\n\nExplanation 1—It may amount to defamation to impute anything to a deceased person, if the\nimputation would harm the reputation of that person if living, and is intended to be hurtful to the fellings\nof his family or other near relatives.\n\nExplanation 2——It may amount to defamation to make an imputation concerning a company or an\nassociation or collection of persons as such.\n\nExplanation 3 —An imputation in the form of an alternative or expressed ironically, may amount to\ndefamation.\n\nExplanation 4——No imputation is said to harm a person's reputation, unless that imputation directly\nor indirectly, in the estimation of others, lowers the moral or intellectual character of that person, or\nlowers the character of that person in respect of his caste or of his calling, or lowers the credit of that\nperson, or causes it to be believed that the body of that person is in a lothsome state, or in a state generally\nconsidered as disgraceful.\n\nIllustrations\n\n(a) A says— “Z is an honest man; he never stole B's watch”; intending to cause it to be believed that Z did steal B's watch.\nThis is defamation, unless it fall within one of the exceptions.\n\n(b) A is asked who stole B's watch. A points to Z, intending to cause it to be believed that Z stole B's watch. This is\ndefamation, unless it fall within one of the exceptions.\n\n1. Ins. by Act 46 of 1983, s. 2.\n\n108\n\n\n(c) A draws a picture of Z running away with B's watch, intending it to be believed that Z stole B's watch. This is\ndefamation, unless it fall within one of the exceptions.\n\nFirst Exception —Imputation of truth which public good requires to be made or published —It\nis not defamation to impute anything which is true concerning any person, if it be for the public good that\nthe imputation should be made or published. Whether or not it is for the public good is a question of fact.\n\nSecond Exception —Public conduct of public servants.—It is not defamation to express in good\nfaith any opinion whatever respecting the conduct of a public servant in the discharge of his public\nfunctions, or respecting his character, so far as his character appears in that conduct, and no further.\n\nThird Exception —Conduct of any person touching any public question.—It is not defamation to\nexpress in good faith any opinion whatever respecting the conduct of any person touching any public\nquestion, and respecting his character, so far as his character appears in that conduct, and no further.\n\nIllustration\n\nIt is not defamation in A to express in good faith any opinion whatever resepting Z's conduct in petitioning Government on a\npublic question, in signing a requisition for a meeting on a public question, in presiding or attending at such meeting, in forming\nor joining any society which invites the public support, in voting or canvassing for a particular candidate for any situation in the\nefficient discharge of the duties of which the public is interested.\n\nFourth Exception—Publication of reports of proceedings of courts.—It is not defamation to\npublish substantially true report of the proceedings of a Court of Justice, or of the result of any such\nproceedings.\n\nExplanation.—A Justice of the Peace or other officer holding an enquiry in open Court preliminary to\na trial in a Court of Justice, is a Court within the meaning of the above section.\n\nFifth Exception—Merits of case decided in Court or conduct of witnesses and others\nconcerned.—It is not defamation to express in good faith any opinion whatever respecting the merits of\nany case, civil or criminal, which has been decided by a Court of Justice, or respecting the conduct of any\nperson as a party, witness or agent, in any such case, or respecting the character of such person, as far as\nhis character appears in that conduct, and no further.\n\nIllustrations\n\n(a) A says—‘I think Z's evidence on that trial is so contradictory that he must be stupid or dishonest.” A is within this\nexception if he says this in good faith, inasmuch as the opinion which he expresses respects Z's character as it appears in Z's\nconduct as a witness, and no farther.\n\n(b) But if A says—‘I do not believe what Z asserted at that trial because I know him to be a man without veracity”; A is not\nwithin this exception, inasmuch as the opinion which express of Z's character, is an opinion not founded on Z's conduct as a\nwitness.\n\nSixth Exception—Merits of public performance.—It is not defamation to express in good faith any\nopinion respecting the merits of any performance which its author has submitted to the judgment of the\npublic, or respecting the character of the author so far as his character appears in such performance, and\nno further.\n\nExplanation.—A performance may be submitted to the judgment of the public expressly or by acts on\nthe part of the author which imply such submission to the judgment of the public.\n\nIllustrations\n(a) A person who publishes a book, submits that book to the judgment of the public.\n(b) A person who makes a speech in public, submits that speech to the judgment of the public.\n\n(c) An actor or singer who appears on a public stage, submits his acting or singing to the judgment of the public.\n\n(d) A says of a book published by Z—“‘Z’s book is foolish; Z must be a weak man. Z's book is indecent; Z must be a man\nof impure mind.” A is within the exception, if he says this in good faith, inasmuch as the opinion which he expresses of Z\nrespects Z's character only so far as it appears in Z's book, and no further.\n\n(e) But if A says “I am not surprised that Z's book is foolish and indecent, for he is a weak man and a libertine.” A is not\nwithin this exception, inasmuch as the opinion which he expresses of Z's character is an opinion not founded on Z's book.\n\nSeventh Exception—Censure passed in good faith by person having lawful authority over\nanother.—It is not defamation in a person having over another any authority, either conferred by law or\n\n109\n\n\narising out of a lawful contract made with that other, to pass in good faith any censure on the conduct of\nthat other in matters to which such lawful authority relates.\n\nIllustration\n\nA Judge censuring in good faith the conduct of a witness, or of an officer of the Court; a head of a department censuring in\ngood faith those who are under his orders, a parent censuring in good faith a child in the presence of other children; a\nschoolmaster, whose authority is derived from a parent, censuring in good faith a pupil in the presence of other pupils; a master\ncensuring a servant in good faith for remissness in service; a banker censuring in good faith the cashier of his bank for the\nconduct of such cashier as such cashier- are within this exception.\n\nEighth Exception—Accusation preferred in good faith to authorised person.—lIt is not\ndefamation to prefer in good faith an accusation against any person to any of those who have lawful\nauthority over that person with respect to the subject-matter of accusation.\n\nIllustration\n\nIf A in good faith accuses Z before a Magistrate; if A in good faith complains of the conduct of Z, a servant, to Z's master;if\nA in good faith complains of the conduct of Z, a child, to Z's father-A is within this exception.\n\nNinth Exception—Imputation made in good faith by person for protection of his or other's\ninterests —It is not defamation to make an imputation on the character of another provided that the\nimputation be made in good faith for the protection of the interests of the person making it, or of any\nother person, or for the public good.\n\nIllustrations\n\n(a) A, a shopkeeper, says to B, who manages his business—‘‘Sell nothing to Z unless he pays you ready money, for I have\nno opinion of his honesty.” A is within the exception, if he has made this imputation on Z in good faith for the protection of his\nown interests.\n\n(b) A, a Magistrate, in making a report to his own superior officer, casts an imputation on the character of Z. Here, if the\nimputation is made in good faith, and for the public good, A is within the exception.\n\nTenth Exception—Caution intended for good of person to whom conveyed or for public good.—\nIt is not defamation to convey a caution, in good faith, to one person against another, provided that such\ncaution be intended for the good of the person to whom it is conveyed, or of some person in whom that\nperson is interested, or for the public good.\n\n500. Punishment for defamation—Whoever defames another shall be punished with simple\nimprisonment for a term which may extend to two years, or with fine, or with both.\n\n501. Printing or engraving matter known to be defamatory—Whoever prints or engraves any\nmatter, knowing or having good reason to believe that such matter is defamatory of any person, shall be\npunished with simple imprisonment for a term which may extend to two years, or with fine, or with both.\n\n502. Sale of printed or engraved substance containing defamatory matter—Whoever sells or\noffers for sale any printed or engraved substance containing defamatory matter, knowing that it contains\nsuch matter, shall be punished with simple imprisonment for a term which may extend to two years, or\nwith fine, or with both.\n\nCHAPTER XXII\nOF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE\n\n503. Criminal intimidation —Whoever threatens another with any injury to his person, reputation or\nproperty, or to the person or reputation of any one in whom that person is interested, with intent to cause\nalarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit\nto do any act which that person is legally entitled to do, as the means of avoiding the execution of such\nthreat, commits criminal intimidation.\n\nExplanation.—A threat to injure the reputation of any deceased person in whom the person threatened\nis interested, is within this section.\n\nIllustration\n\nA, for the purpose of inducing B to resist from prosecuting a civil suit, threatens to burn B's house. A is guilty of criminal\nintimidation.\n\n110\n\n\n504. Intentional insult with intent to provoke breach of the peace—Whoever intentionally\ninsults, and thereby gives provocation to any person, intending or knowing it to be likely that such\nprovocation will cause him to break the public peace, or to commit any other offence, shall be punished\nwith imprisonment of either description for a term which may extend to two years, or with fine, or with\nboth.\n\n'[505. Statements conducing to public mischief.—[(/)] Whoever makes, publishes or circulates\nany statement, rumour or report,—\n\n(a) with intent to cause, or which is likely to cause, any officer, soldier, *[sailor or airman] in the\nArmy, “[Navy or Air Force] *[of India] to mutiny or otherwise disregard or fail in his duty as such; or\n\n(6) with intent to cause, or which is likely to cause, fear or alarm to the public, or to any section\nof the public whereby any person may be induced to commit an offence against the State or against\nthe public tranquility; or\n\n(c) with intent to incite, or which is likely to incite, any class or community of persons to commit\nany offence against any other class or community,\n\nshall be punished with imprisonment which may extend to “[three years], or with fine, or with both.\n\n7[(2) Statements creating or promoting enmity, hatred or ill-will between classes —Whoever\nmakes, publishes or circulates any statement or report containing rumour or alarming news with intent to\ncreate or promote, or which is likely to create or promote, on grounds of religion, race, place of birth,\nresidence, language, caste or community or any other ground whatsoever, feelings of enmity, hatred or ill-\nwill between different religious, racial, language or regional groups or castes or communities, shall be\npunished with imprisonment which may extend to three years, or with fine, or with both.\n\n(3) Offence under sub-section (2) committed in place of worship, ete—Whoever commits an\noffence specified in sub-section (2) in any place of worship or in any assembly engaged in the\nperformance of religious worship or religious ceremonies, shall be punished with imprisonment which\nmay extend to five years and shall also be liable to fine. ]\n\nException.—It does not amount to an offence, within the meaning of this section, when the person\nmaking, publishing or circulating any such statement, rumour or report, has reasonable grounds for\nbelieving that such statement, rumour or report is true and makes, publishes or circulates it *[in good faith\nand] without any such intent as aforesaid. ]\n\n506. Punishment for criminal intimidation—Whoever commits the offence of criminal\nintimidation shall be punished with imprisonment of either description for a term which may extend to\ntwo years, or with fine, or with both;\n\nIf threat be to cause death or grievous hurt, etc ——and if the threat be to cause death or grievous\nhurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or\n‘imprisonment for life], or with imprisonment for a term which may extend to seven years, or to impute\nunchastity to a woman, shall be punished with imprisonment of either description for a term which may\nextend to seven years, or with fine, or with both.\n\n507. Criminal intimidation by an anonymous communication.—Whoever commits the offence of\ncriminal intimidation by an anonymous communication, or having taken precaution to conceal the name\nor abode of the person from whom the threat comes, shall be punished with imprisonment of either\ndescription for a term which may extend to two years, in addition to the punishment provided for the\noffence by the last preceding section.\n\n. Subs. by Act 4 of 1898, s. 6, for s. 505.\n\n. Section 505 re-numbered as sub-section (/) of that section by Act 35 of 1969, s. 3.\n\n. Subs. by Act 10 of 1927, s. 2 and the First Sch., for “or sailor”.\n\n. Subs. by s. 2 and the First Sch., ibid., for “or Navy”.\n\n. Subs. by the A. O. 1950, for “of Her Majesty or in the Imperial Service Troops” The words “or in the Royal Indian Marine”\noccurring after the word “Majesty” omitted by Act 35 of 1934, s. 2 and Sch.\n\n. Subs. by Act 41 of 1961, s. 4, for “two years”.\n\n. Ins. by Act 35 of 1969, s. 3.\n\n8. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation” (w.e.f. 1-1-1956).\n\nABWN EE\n\naD\n\n111\n\n\n508. Act caused by inducing person to believe that he will be rendered an object of the Divine\ndispleasure —Whoever voluntarily causes or attempts to cause any person to do anything which that\nperson is not legally bound to do, or to omit to do anything which he is legally entitled to do, by inducing\nor attempting to induce that person to believe that he or any person in whom he is interested will become\nor will be rendered by some act of the offender an object of Divine displeasure if he does not do the thing\nwhich it is the object of the offender to cause him to do, or if he does the thing which it is the object of the\noffender to cause him to omit, shall be punished with imprisonment of either description for a term which\nmay extend to one year, or with fine, or with both.\n\nIllustrations\n\n(a) A sits dhurna at Z's door with the intention of causing it to be believed that, by so sitting, he renders Z an object of\nDivine displeasure. A has committed the offence defined in this section.\n\n(b) A threatens Z that, unless Z performs a certain act, A will kill one of A's own children, under such circumstances that the\nkilling would be believed to render Z an object of Divine displeasure. A has committed the offence defined in this section.\n\n509. Word, gesture or act intended to insult the modesty of a woman.—Whoever, intending to\ninsult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object,\nintending that such word or sound shall be heard, or that such gesture or object shall be seen, by such\nwoman, or intrudes upon the privacy of such woman, '[shall be punished with simple imprisonment for a\nterm which may extend to three years, and also with fine].\n\n510. Misconduct in public by a drunken person— Whoever, in a state of intoxication, appears in\nany public place, or in any place which it is a trespass in him to enter, and there conducts himself in such\na manner as to cause annoyance to any person, shall be punished with simple imprisonment for a term\nwhich may extend to twenty-four hours, or with fine which may extend to ten rupees, or with both.\n\nCHAPTER XXIII\nOF ATTEMPTS TO COMMIT OFFENCES\n\n511. Punishment for attempting to commit offences punishable with imprisonment for life or\nother imprisonment.—Whoever attempts to commit an offence punishable by this Code with\n*[imprisonment for life] or imprisonment, or to cause such an offence to be committed, and in such\nattempt does any act towards the commission of the offence, shall, where no express provision is made by\nthis Code for the punishment of such attempt, be punished with *[imprisonment of any description\nprovided for the offence, for a term which may extend to one-half of the imprisonment for life or, as the\ncase may be, one- half of the longest term of imprisonment provided for that offence], or with such fine as\nis provided for the offence, or with both.\n\nIllustrations\n\n(a) A makes an attempt to steal some jewels by breaking open a box, and finds after so opening the box, that there is no\njewel in it. He has done an act towards the commission of theft, and therefore is guilty under this section.\n\n(b) A makes an attempt to pick the pocket of Z by thrusting his hand into Z's pocket. A fails in the attempt in consequence of\nZ's having nothing in his pocket. A is guilty under this section.\n\n1. Subs. by Act 13 of 2013, s. 10, for “shall be punished with simple imprisonment for a term which may extend to one year, or\nwith fine, or with both” (w.e.f. 3-2-2013).\n\n2. Subs. by Act 26 of 1955, s. 117 and the Sch., for “transportation” (w.e.f. 1-1-1956).\n\n3. Subs. by s. 117 and the Sch., ibid., for certain words (w.e.f. 1-1-1956).\n\n112",
    "easy_meaning": "",
    "punishment": "",
    "example": "",
    "related_sections": []
  }
]